kcuzner/teensy-oscilloscope/scope-teensy/include/MK65F18WS.h
/* FPB - Register array accessors */
#define FPB_COMP(index)                          FPB_COMP_REG(FPB_BASE_PTR,index)

/*!
 * @}
 */ /* end of group FPB_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group FPB_Peripheral */


/* ----------------------------------------------------------------------------
   -- FTFE
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTFE_Peripheral FTFE
 * @{
 */

/** FTFE - Peripheral register structure */
typedef struct FTFE_MemMap {
  uint8_t FSTAT;                                   /**< Flash Status Register, offset: 0x0 */
  uint8_t FCNFG;                                   /**< Flash Configuration Register, offset: 0x1 */
  uint8_t FSEC;                                    /**< Flash Security Register, offset: 0x2 */
  uint8_t FOPT;                                    /**< Flash Option Register, offset: 0x3 */
  uint8_t FCCOB3;                                  /**< Flash Common Command Object Registers, offset: 0x4 */
  uint8_t FCCOB2;                                  /**< Flash Common Command Object Registers, offset: 0x5 */
  uint8_t FCCOB1;                                  /**< Flash Common Command Object Registers, offset: 0x6 */
  uint8_t FCCOB0;                                  /**< Flash Common Command Object Registers, offset: 0x7 */
  uint8_t FCCOB7;                                  /**< Flash Common Command Object Registers, offset: 0x8 */
  uint8_t FCCOB6;                                  /**< Flash Common Command Object Registers, offset: 0x9 */
  uint8_t FCCOB5;                                  /**< Flash Common Command Object Registers, offset: 0xA */
  uint8_t FCCOB4;                                  /**< Flash Common Command Object Registers, offset: 0xB */
  uint8_t FCCOBB;                                  /**< Flash Common Command Object Registers, offset: 0xC */
  uint8_t FCCOBA;                                  /**< Flash Common Command Object Registers, offset: 0xD */
  uint8_t FCCOB9;                                  /**< Flash Common Command Object Registers, offset: 0xE */
  uint8_t FCCOB8;                                  /**< Flash Common Command Object Registers, offset: 0xF */
  uint8_t FPROT3;                                  /**< Program Flash Protection Registers, offset: 0x10 */
  uint8_t FPROT2;                                  /**< Program Flash Protection Registers, offset: 0x11 */
  uint8_t FPROT1;                                  /**< Program Flash Protection Registers, offset: 0x12 */
  uint8_t FPROT0;                                  /**< Program Flash Protection Registers, offset: 0x13 */
  uint8_t RESERVED_0[2];
  uint8_t FEPROT;                                  /**< EEPROM Protection Register, offset: 0x16 */
  uint8_t FDPROT;                                  /**< Data Flash Protection Register, offset: 0x17 */
  uint8_t XACCH3;                                  /**< Execute-only Access Registers, offset: 0x18 */
  uint8_t XACCH2;                                  /**< Execute-only Access Registers, offset: 0x19 */
  uint8_t XACCH1;                                  /**< Execute-only Access Registers, offset: 0x1A */
  uint8_t XACCH0;                                  /**< Execute-only Access Registers, offset: 0x1B */
  uint8_t XACCL3;                                  /**< Execute-only Access Registers, offset: 0x1C */
  uint8_t XACCL2;                                  /**< Execute-only Access Registers, offset: 0x1D */
  uint8_t XACCL1;                                  /**< Execute-only Access Registers, offset: 0x1E */
  uint8_t XACCL0;                                  /**< Execute-only Access Registers, offset: 0x1F */
  uint8_t SACCH3;                                  /**< Supervisor-only Access Registers, offset: 0x20 */
  uint8_t SACCH2;                                  /**< Supervisor-only Access Registers, offset: 0x21 */
  uint8_t SACCH1;                                  /**< Supervisor-only Access Registers, offset: 0x22 */
  uint8_t SACCH0;                                  /**< Supervisor-only Access Registers, offset: 0x23 */
  uint8_t SACCL3;                                  /**< Supervisor-only Access Registers, offset: 0x24 */
  uint8_t SACCL2;                                  /**< Supervisor-only Access Registers, offset: 0x25 */
  uint8_t SACCL1;                                  /**< Supervisor-only Access Registers, offset: 0x26 */
  uint8_t SACCL0;                                  /**< Supervisor-only Access Registers, offset: 0x27 */
  uint8_t FACSS;                                   /**< Flash Access Segment Size Register, offset: 0x28 */
  uint8_t RESERVED_1[2];
  uint8_t FACSN;                                   /**< Flash Access Segment Number Register, offset: 0x2B */
} volatile *FTFE_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- FTFE - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTFE_Register_Accessor_Macros FTFE - Register accessor macros
 * @{
 */


/* FTFE - Register accessors */
#define FTFE_FSTAT_REG(base)                     ((base)->FSTAT)
#define FTFE_FCNFG_REG(base)                     ((base)->FCNFG)
#define FTFE_FSEC_REG(base)                      ((base)->FSEC)
#define FTFE_FOPT_REG(base)                      ((base)->FOPT)
#define FTFE_FCCOB3_REG(base)                    ((base)->FCCOB3)
#define FTFE_FCCOB2_REG(base)                    ((base)->FCCOB2)
#define FTFE_FCCOB1_REG(base)                    ((base)->FCCOB1)
#define FTFE_FCCOB0_REG(base)                    ((base)->FCCOB0)
#define FTFE_FCCOB7_REG(base)                    ((base)->FCCOB7)
#define FTFE_FCCOB6_REG(base)                    ((base)->FCCOB6)
#define FTFE_FCCOB5_REG(base)                    ((base)->FCCOB5)
#define FTFE_FCCOB4_REG(base)                    ((base)->FCCOB4)
#define FTFE_FCCOBB_REG(base)                    ((base)->FCCOBB)
#define FTFE_FCCOBA_REG(base)                    ((base)->FCCOBA)
#define FTFE_FCCOB9_REG(base)                    ((base)->FCCOB9)
#define FTFE_FCCOB8_REG(base)                    ((base)->FCCOB8)
#define FTFE_FPROT3_REG(base)                    ((base)->FPROT3)
#define FTFE_FPROT2_REG(base)                    ((base)->FPROT2)
#define FTFE_FPROT1_REG(base)                    ((base)->FPROT1)
#define FTFE_FPROT0_REG(base)                    ((base)->FPROT0)
#define FTFE_FEPROT_REG(base)                    ((base)->FEPROT)
#define FTFE_FDPROT_REG(base)                    ((base)->FDPROT)
#define FTFE_XACCH3_REG(base)                    ((base)->XACCH3)
#define FTFE_XACCH2_REG(base)                    ((base)->XACCH2)
#define FTFE_XACCH1_REG(base)                    ((base)->XACCH1)
#define FTFE_XACCH0_REG(base)                    ((base)->XACCH0)
#define FTFE_XACCL3_REG(base)                    ((base)->XACCL3)
#define FTFE_XACCL2_REG(base)                    ((base)->XACCL2)
#define FTFE_XACCL1_REG(base)                    ((base)->XACCL1)
#define FTFE_XACCL0_REG(base)                    ((base)->XACCL0)
#define FTFE_SACCH3_REG(base)                    ((base)->SACCH3)
#define FTFE_SACCH2_REG(base)                    ((base)->SACCH2)
#define FTFE_SACCH1_REG(base)                    ((base)->SACCH1)
#define FTFE_SACCH0_REG(base)                    ((base)->SACCH0)
#define FTFE_SACCL3_REG(base)                    ((base)->SACCL3)
#define FTFE_SACCL2_REG(base)                    ((base)->SACCL2)
#define FTFE_SACCL1_REG(base)                    ((base)->SACCL1)
#define FTFE_SACCL0_REG(base)                    ((base)->SACCL0)
#define FTFE_FACSS_REG(base)                     ((base)->FACSS)
#define FTFE_FACSN_REG(base)                     ((base)->FACSN)

/*!
 * @}
 */ /* end of group FTFE_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- FTFE Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTFE_Register_Masks FTFE Register Masks
 * @{
 */

/* FSTAT Bit Fields */
#define FTFE_FSTAT_MGSTAT0_MASK                  0x1u
#define FTFE_FSTAT_MGSTAT0_SHIFT                 0
#define FTFE_FSTAT_FPVIOL_MASK                   0x10u
#define FTFE_FSTAT_FPVIOL_SHIFT                  4
#define FTFE_FSTAT_ACCERR_MASK                   0x20u
#define FTFE_FSTAT_ACCERR_SHIFT                  5
#define FTFE_FSTAT_RDCOLERR_MASK                 0x40u
#define FTFE_FSTAT_RDCOLERR_SHIFT                6
#define FTFE_FSTAT_CCIF_MASK                     0x80u
#define FTFE_FSTAT_CCIF_SHIFT                    7
/* FCNFG Bit Fields */
#define FTFE_FCNFG_EEERDY_MASK                   0x1u
#define FTFE_FCNFG_EEERDY_SHIFT                  0
#define FTFE_FCNFG_RAMRDY_MASK                   0x2u
#define FTFE_FCNFG_RAMRDY_SHIFT                  1
#define FTFE_FCNFG_PFLSH_MASK                    0x4u
#define FTFE_FCNFG_PFLSH_SHIFT                   2
#define FTFE_FCNFG_SWAP_MASK                     0x8u
#define FTFE_FCNFG_SWAP_SHIFT                    3
#define FTFE_FCNFG_ERSSUSP_MASK                  0x10u
#define FTFE_FCNFG_ERSSUSP_SHIFT                 4
#define FTFE_FCNFG_ERSAREQ_MASK                  0x20u
#define FTFE_FCNFG_ERSAREQ_SHIFT                 5
#define FTFE_FCNFG_RDCOLLIE_MASK                 0x40u
#define FTFE_FCNFG_RDCOLLIE_SHIFT                6
#define FTFE_FCNFG_CCIE_MASK                     0x80u
#define FTFE_FCNFG_CCIE_SHIFT                    7
/* FSEC Bit Fields */
#define FTFE_FSEC_SEC_MASK                       0x3u
#define FTFE_FSEC_SEC_SHIFT                      0
#define FTFE_FSEC_SEC(x)                         (((uint8_t)(((uint8_t)(x))<<FTFE_FSEC_SEC_SHIFT))&FTFE_FSEC_SEC_MASK)
#define FTFE_FSEC_FSLACC_MASK                    0xCu
#define FTFE_FSEC_FSLACC_SHIFT                   2
#define FTFE_FSEC_FSLACC(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FSEC_FSLACC_SHIFT))&FTFE_FSEC_FSLACC_MASK)
#define FTFE_FSEC_MEEN_MASK                      0x30u
#define FTFE_FSEC_MEEN_SHIFT                     4
#define FTFE_FSEC_MEEN(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_FSEC_MEEN_SHIFT))&FTFE_FSEC_MEEN_MASK)
#define FTFE_FSEC_KEYEN_MASK                     0xC0u
#define FTFE_FSEC_KEYEN_SHIFT                    6
#define FTFE_FSEC_KEYEN(x)                       (((uint8_t)(((uint8_t)(x))<<FTFE_FSEC_KEYEN_SHIFT))&FTFE_FSEC_KEYEN_MASK)
/* FOPT Bit Fields */
#define FTFE_FOPT_OPT_MASK                       0xFFu
#define FTFE_FOPT_OPT_SHIFT                      0
#define FTFE_FOPT_OPT(x)                         (((uint8_t)(((uint8_t)(x))<<FTFE_FOPT_OPT_SHIFT))&FTFE_FOPT_OPT_MASK)
/* FCCOB3 Bit Fields */
#define FTFE_FCCOB3_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB3_CCOBn_SHIFT                  0
#define FTFE_FCCOB3_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB3_CCOBn_SHIFT))&FTFE_FCCOB3_CCOBn_MASK)
/* FCCOB2 Bit Fields */
#define FTFE_FCCOB2_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB2_CCOBn_SHIFT                  0
#define FTFE_FCCOB2_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB2_CCOBn_SHIFT))&FTFE_FCCOB2_CCOBn_MASK)
/* FCCOB1 Bit Fields */
#define FTFE_FCCOB1_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB1_CCOBn_SHIFT                  0
#define FTFE_FCCOB1_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB1_CCOBn_SHIFT))&FTFE_FCCOB1_CCOBn_MASK)
/* FCCOB0 Bit Fields */
#define FTFE_FCCOB0_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB0_CCOBn_SHIFT                  0
#define FTFE_FCCOB0_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB0_CCOBn_SHIFT))&FTFE_FCCOB0_CCOBn_MASK)
/* FCCOB7 Bit Fields */
#define FTFE_FCCOB7_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB7_CCOBn_SHIFT                  0
#define FTFE_FCCOB7_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB7_CCOBn_SHIFT))&FTFE_FCCOB7_CCOBn_MASK)
/* FCCOB6 Bit Fields */
#define FTFE_FCCOB6_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB6_CCOBn_SHIFT                  0
#define FTFE_FCCOB6_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB6_CCOBn_SHIFT))&FTFE_FCCOB6_CCOBn_MASK)
/* FCCOB5 Bit Fields */
#define FTFE_FCCOB5_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB5_CCOBn_SHIFT                  0
#define FTFE_FCCOB5_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB5_CCOBn_SHIFT))&FTFE_FCCOB5_CCOBn_MASK)
/* FCCOB4 Bit Fields */
#define FTFE_FCCOB4_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB4_CCOBn_SHIFT                  0
#define FTFE_FCCOB4_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB4_CCOBn_SHIFT))&FTFE_FCCOB4_CCOBn_MASK)
/* FCCOBB Bit Fields */
#define FTFE_FCCOBB_CCOBn_MASK                   0xFFu
#define FTFE_FCCOBB_CCOBn_SHIFT                  0
#define FTFE_FCCOBB_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOBB_CCOBn_SHIFT))&FTFE_FCCOBB_CCOBn_MASK)
/* FCCOBA Bit Fields */
#define FTFE_FCCOBA_CCOBn_MASK                   0xFFu
#define FTFE_FCCOBA_CCOBn_SHIFT                  0
#define FTFE_FCCOBA_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOBA_CCOBn_SHIFT))&FTFE_FCCOBA_CCOBn_MASK)
/* FCCOB9 Bit Fields */
#define FTFE_FCCOB9_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB9_CCOBn_SHIFT                  0
#define FTFE_FCCOB9_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB9_CCOBn_SHIFT))&FTFE_FCCOB9_CCOBn_MASK)
/* FCCOB8 Bit Fields */
#define FTFE_FCCOB8_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB8_CCOBn_SHIFT                  0
#define FTFE_FCCOB8_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB8_CCOBn_SHIFT))&FTFE_FCCOB8_CCOBn_MASK)
/* FPROT3 Bit Fields */
#define FTFE_FPROT3_PROT_MASK                    0xFFu
#define FTFE_FPROT3_PROT_SHIFT                   0
#define FTFE_FPROT3_PROT(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FPROT3_PROT_SHIFT))&FTFE_FPROT3_PROT_MASK)
/* FPROT2 Bit Fields */
#define FTFE_FPROT2_PROT_MASK                    0xFFu
#define FTFE_FPROT2_PROT_SHIFT                   0
#define FTFE_FPROT2_PROT(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FPROT2_PROT_SHIFT))&FTFE_FPROT2_PROT_MASK)
/* FPROT1 Bit Fields */
#define FTFE_FPROT1_PROT_MASK                    0xFFu
#define FTFE_FPROT1_PROT_SHIFT                   0
#define FTFE_FPROT1_PROT(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FPROT1_PROT_SHIFT))&FTFE_FPROT1_PROT_MASK)
/* FPROT0 Bit Fields */
#define FTFE_FPROT0_PROT_MASK                    0xFFu
#define FTFE_FPROT0_PROT_SHIFT                   0
#define FTFE_FPROT0_PROT(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FPROT0_PROT_SHIFT))&FTFE_FPROT0_PROT_MASK)
/* FEPROT Bit Fields */
#define FTFE_FEPROT_EPROT_MASK                   0xFFu
#define FTFE_FEPROT_EPROT_SHIFT                  0
#define FTFE_FEPROT_EPROT(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FEPROT_EPROT_SHIFT))&FTFE_FEPROT_EPROT_MASK)
/* FDPROT Bit Fields */
#define FTFE_FDPROT_DPROT_MASK                   0xFFu
#define FTFE_FDPROT_DPROT_SHIFT                  0
#define FTFE_FDPROT_DPROT(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FDPROT_DPROT_SHIFT))&FTFE_FDPROT_DPROT_MASK)
/* XACCH3 Bit Fields */
#define FTFE_XACCH3_XA_MASK                      0xFFu
#define FTFE_XACCH3_XA_SHIFT                     0
#define FTFE_XACCH3_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCH3_XA_SHIFT))&FTFE_XACCH3_XA_MASK)
/* XACCH2 Bit Fields */
#define FTFE_XACCH2_XA_MASK                      0xFFu
#define FTFE_XACCH2_XA_SHIFT                     0
#define FTFE_XACCH2_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCH2_XA_SHIFT))&FTFE_XACCH2_XA_MASK)
/* XACCH1 Bit Fields */
#define FTFE_XACCH1_XA_MASK                      0xFFu
#define FTFE_XACCH1_XA_SHIFT                     0
#define FTFE_XACCH1_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCH1_XA_SHIFT))&FTFE_XACCH1_XA_MASK)
/* XACCH0 Bit Fields */
#define FTFE_XACCH0_XA_MASK                      0xFFu
#define FTFE_XACCH0_XA_SHIFT                     0
#define FTFE_XACCH0_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCH0_XA_SHIFT))&FTFE_XACCH0_XA_MASK)
/* XACCL3 Bit Fields */
#define FTFE_XACCL3_XA_MASK                      0xFFu
#define FTFE_XACCL3_XA_SHIFT                     0
#define FTFE_XACCL3_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCL3_XA_SHIFT))&FTFE_XACCL3_XA_MASK)
/* XACCL2 Bit Fields */
#define FTFE_XACCL2_XA_MASK                      0xFFu
#define FTFE_XACCL2_XA_SHIFT                     0
#define FTFE_XACCL2_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCL2_XA_SHIFT))&FTFE_XACCL2_XA_MASK)
/* XACCL1 Bit Fields */
#define FTFE_XACCL1_XA_MASK                      0xFFu
#define FTFE_XACCL1_XA_SHIFT                     0
#define FTFE_XACCL1_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCL1_XA_SHIFT))&FTFE_XACCL1_XA_MASK)
/* XACCL0 Bit Fields */
#define FTFE_XACCL0_XA_MASK                      0xFFu
#define FTFE_XACCL0_XA_SHIFT                     0
#define FTFE_XACCL0_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCL0_XA_SHIFT))&FTFE_XACCL0_XA_MASK)
/* SACCH3 Bit Fields */
#define FTFE_SACCH3_SA_MASK                      0xFFu
#define FTFE_SACCH3_SA_SHIFT                     0
#define FTFE_SACCH3_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCH3_SA_SHIFT))&FTFE_SACCH3_SA_MASK)
/* SACCH2 Bit Fields */
#define FTFE_SACCH2_SA_MASK                      0xFFu
#define FTFE_SACCH2_SA_SHIFT                     0
#define FTFE_SACCH2_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCH2_SA_SHIFT))&FTFE_SACCH2_SA_MASK)
/* SACCH1 Bit Fields */
#define FTFE_SACCH1_SA_MASK                      0xFFu
#define FTFE_SACCH1_SA_SHIFT                     0
#define FTFE_SACCH1_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCH1_SA_SHIFT))&FTFE_SACCH1_SA_MASK)
/* SACCH0 Bit Fields */
#define FTFE_SACCH0_SA_MASK                      0xFFu
#define FTFE_SACCH0_SA_SHIFT                     0
#define FTFE_SACCH0_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCH0_SA_SHIFT))&FTFE_SACCH0_SA_MASK)
/* SACCL3 Bit Fields */
#define FTFE_SACCL3_SA_MASK                      0xFFu
#define FTFE_SACCL3_SA_SHIFT                     0
#define FTFE_SACCL3_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCL3_SA_SHIFT))&FTFE_SACCL3_SA_MASK)
/* SACCL2 Bit Fields */
#define FTFE_SACCL2_SA_MASK                      0xFFu
#define FTFE_SACCL2_SA_SHIFT                     0
#define FTFE_SACCL2_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCL2_SA_SHIFT))&FTFE_SACCL2_SA_MASK)
/* SACCL1 Bit Fields */
#define FTFE_SACCL1_SA_MASK                      0xFFu
#define FTFE_SACCL1_SA_SHIFT                     0
#define FTFE_SACCL1_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCL1_SA_SHIFT))&FTFE_SACCL1_SA_MASK)
/* SACCL0 Bit Fields */
#define FTFE_SACCL0_SA_MASK                      0xFFu
#define FTFE_SACCL0_SA_SHIFT                     0
#define FTFE_SACCL0_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCL0_SA_SHIFT))&FTFE_SACCL0_SA_MASK)
/* FACSS Bit Fields */
#define FTFE_FACSS_SGSIZE_MASK                   0xFFu
#define FTFE_FACSS_SGSIZE_SHIFT                  0
#define FTFE_FACSS_SGSIZE(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FACSS_SGSIZE_SHIFT))&FTFE_FACSS_SGSIZE_MASK)
/* FACSN Bit Fields */
#define FTFE_FACSN_NUMSG_MASK                    0xFFu
#define FTFE_FACSN_NUMSG_SHIFT                   0
#define FTFE_FACSN_NUMSG(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FACSN_NUMSG_SHIFT))&FTFE_FACSN_NUMSG_MASK)

/*!
 * @}
 */ /* end of group FTFE_Register_Masks */


/* FTFE - Peripheral instance base addresses */
/** Peripheral FTFE base pointer */
#define FTFE_BASE_PTR                            ((FTFE_MemMapPtr)0x40020000u)
/** Array initializer of FTFE peripheral base pointers */
#define FTFE_BASE_PTRS                           { FTFE_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- FTFE - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTFE_Register_Accessor_Macros FTFE - Register accessor macros
 * @{
 */


