kcuzner/teensy-oscilloscope/scope-teensy/include/MK65F18WS.h
/* FTFE - Register instance definitions */
/* FTFE */
#define FTFE_FSTAT                               FTFE_FSTAT_REG(FTFE_BASE_PTR)
#define FTFE_FCNFG                               FTFE_FCNFG_REG(FTFE_BASE_PTR)
#define FTFE_FSEC                                FTFE_FSEC_REG(FTFE_BASE_PTR)
#define FTFE_FOPT                                FTFE_FOPT_REG(FTFE_BASE_PTR)
#define FTFE_FCCOB3                              FTFE_FCCOB3_REG(FTFE_BASE_PTR)
#define FTFE_FCCOB2                              FTFE_FCCOB2_REG(FTFE_BASE_PTR)
#define FTFE_FCCOB1                              FTFE_FCCOB1_REG(FTFE_BASE_PTR)
#define FTFE_FCCOB0                              FTFE_FCCOB0_REG(FTFE_BASE_PTR)
#define FTFE_FCCOB7                              FTFE_FCCOB7_REG(FTFE_BASE_PTR)
#define FTFE_FCCOB6                              FTFE_FCCOB6_REG(FTFE_BASE_PTR)
#define FTFE_FCCOB5                              FTFE_FCCOB5_REG(FTFE_BASE_PTR)
#define FTFE_FCCOB4                              FTFE_FCCOB4_REG(FTFE_BASE_PTR)
#define FTFE_FCCOBB                              FTFE_FCCOBB_REG(FTFE_BASE_PTR)
#define FTFE_FCCOBA                              FTFE_FCCOBA_REG(FTFE_BASE_PTR)
#define FTFE_FCCOB9                              FTFE_FCCOB9_REG(FTFE_BASE_PTR)
#define FTFE_FCCOB8                              FTFE_FCCOB8_REG(FTFE_BASE_PTR)
#define FTFE_FPROT3                              FTFE_FPROT3_REG(FTFE_BASE_PTR)
#define FTFE_FPROT2                              FTFE_FPROT2_REG(FTFE_BASE_PTR)
#define FTFE_FPROT1                              FTFE_FPROT1_REG(FTFE_BASE_PTR)
#define FTFE_FPROT0                              FTFE_FPROT0_REG(FTFE_BASE_PTR)
#define FTFE_FEPROT                              FTFE_FEPROT_REG(FTFE_BASE_PTR)
#define FTFE_FDPROT                              FTFE_FDPROT_REG(FTFE_BASE_PTR)
#define FTFE_XACCH3                              FTFE_XACCH3_REG(FTFE_BASE_PTR)
#define FTFE_XACCH2                              FTFE_XACCH2_REG(FTFE_BASE_PTR)
#define FTFE_XACCH1                              FTFE_XACCH1_REG(FTFE_BASE_PTR)
#define FTFE_XACCH0                              FTFE_XACCH0_REG(FTFE_BASE_PTR)
#define FTFE_XACCL3                              FTFE_XACCL3_REG(FTFE_BASE_PTR)
#define FTFE_XACCL2                              FTFE_XACCL2_REG(FTFE_BASE_PTR)
#define FTFE_XACCL1                              FTFE_XACCL1_REG(FTFE_BASE_PTR)
#define FTFE_XACCL0                              FTFE_XACCL0_REG(FTFE_BASE_PTR)
#define FTFE_SACCH3                              FTFE_SACCH3_REG(FTFE_BASE_PTR)
#define FTFE_SACCH2                              FTFE_SACCH2_REG(FTFE_BASE_PTR)
#define FTFE_SACCH1                              FTFE_SACCH1_REG(FTFE_BASE_PTR)
#define FTFE_SACCH0                              FTFE_SACCH0_REG(FTFE_BASE_PTR)
#define FTFE_SACCL3                              FTFE_SACCL3_REG(FTFE_BASE_PTR)
#define FTFE_SACCL2                              FTFE_SACCL2_REG(FTFE_BASE_PTR)
#define FTFE_SACCL1                              FTFE_SACCL1_REG(FTFE_BASE_PTR)
#define FTFE_SACCL0                              FTFE_SACCL0_REG(FTFE_BASE_PTR)
#define FTFE_FACSS                               FTFE_FACSS_REG(FTFE_BASE_PTR)
#define FTFE_FACSN                               FTFE_FACSN_REG(FTFE_BASE_PTR)

/*!
 * @}
 */ /* end of group FTFE_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group FTFE_Peripheral */


/* ----------------------------------------------------------------------------
   -- FTM
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTM_Peripheral FTM
 * @{
 */

/** FTM - Peripheral register structure */
typedef struct FTM_MemMap {
  uint32_t SC;                                     /**< Status And Control, offset: 0x0 */
  uint32_t CNT;                                    /**< Counter, offset: 0x4 */
  uint32_t MOD;                                    /**< Modulo, offset: 0x8 */
  struct {                                         /* offset: 0xC, array step: 0x8 */
    uint32_t CnSC;                                   /**< Channel (n) Status And Control, array offset: 0xC, array step: 0x8 */
    uint32_t CnV;                                    /**< Channel (n) Value, array offset: 0x10, array step: 0x8 */
  } CONTROLS[8];
  uint32_t CNTIN;                                  /**< Counter Initial Value, offset: 0x4C */
  uint32_t STATUS;                                 /**< Capture And Compare Status, offset: 0x50 */
  uint32_t MODE;                                   /**< Features Mode Selection, offset: 0x54 */
  uint32_t SYNC;                                   /**< Synchronization, offset: 0x58 */
  uint32_t OUTINIT;                                /**< Initial State For Channels Output, offset: 0x5C */
  uint32_t OUTMASK;                                /**< Output Mask, offset: 0x60 */
  uint32_t COMBINE;                                /**< Function For Linked Channels, offset: 0x64 */
  uint32_t DEADTIME;                               /**< Deadtime Insertion Control, offset: 0x68 */
  uint32_t EXTTRIG;                                /**< FTM External Trigger, offset: 0x6C */
  uint32_t POL;                                    /**< Channels Polarity, offset: 0x70 */
  uint32_t FMS;                                    /**< Fault Mode Status, offset: 0x74 */
  uint32_t FILTER;                                 /**< Input Capture Filter Control, offset: 0x78 */
  uint32_t FLTCTRL;                                /**< Fault Control, offset: 0x7C */
  uint32_t QDCTRL;                                 /**< Quadrature Decoder Control And Status, offset: 0x80 */
  uint32_t CONF;                                   /**< Configuration, offset: 0x84 */
  uint32_t FLTPOL;                                 /**< FTM Fault Input Polarity, offset: 0x88 */
  uint32_t SYNCONF;                                /**< Synchronization Configuration, offset: 0x8C */
  uint32_t INVCTRL;                                /**< FTM Inverting Control, offset: 0x90 */
  uint32_t SWOCTRL;                                /**< FTM Software Output Control, offset: 0x94 */
  uint32_t PWMLOAD;                                /**< FTM PWM Load, offset: 0x98 */
} volatile *FTM_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- FTM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTM_Register_Accessor_Macros FTM - Register accessor macros
 * @{
 */


/* FTM - Register accessors */
#define FTM_SC_REG(base)                         ((base)->SC)
#define FTM_CNT_REG(base)                        ((base)->CNT)
#define FTM_MOD_REG(base)                        ((base)->MOD)
#define FTM_CnSC_REG(base,index)                 ((base)->CONTROLS[index].CnSC)
#define FTM_CnV_REG(base,index)                  ((base)->CONTROLS[index].CnV)
#define FTM_CNTIN_REG(base)                      ((base)->CNTIN)
#define FTM_STATUS_REG(base)                     ((base)->STATUS)
#define FTM_MODE_REG(base)                       ((base)->MODE)
#define FTM_SYNC_REG(base)                       ((base)->SYNC)
#define FTM_OUTINIT_REG(base)                    ((base)->OUTINIT)
#define FTM_OUTMASK_REG(base)                    ((base)->OUTMASK)
#define FTM_COMBINE_REG(base)                    ((base)->COMBINE)
#define FTM_DEADTIME_REG(base)                   ((base)->DEADTIME)
#define FTM_EXTTRIG_REG(base)                    ((base)->EXTTRIG)
#define FTM_POL_REG(base)                        ((base)->POL)
#define FTM_FMS_REG(base)                        ((base)->FMS)
#define FTM_FILTER_REG(base)                     ((base)->FILTER)
#define FTM_FLTCTRL_REG(base)                    ((base)->FLTCTRL)
#define FTM_QDCTRL_REG(base)                     ((base)->QDCTRL)
#define FTM_CONF_REG(base)                       ((base)->CONF)
#define FTM_FLTPOL_REG(base)                     ((base)->FLTPOL)
#define FTM_SYNCONF_REG(base)                    ((base)->SYNCONF)
#define FTM_INVCTRL_REG(base)                    ((base)->INVCTRL)
#define FTM_SWOCTRL_REG(base)                    ((base)->SWOCTRL)
#define FTM_PWMLOAD_REG(base)                    ((base)->PWMLOAD)

/*!
 * @}
 */ /* end of group FTM_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- FTM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTM_Register_Masks FTM Register Masks
 * @{
 */

