kcuzner/teensy-oscilloscope/scope-teensy/include/MK65F18WS.h
#define SDHC_ADMAES_ADMALME_SHIFT                2
#define SDHC_ADMAES_ADMADCE_MASK                 0x8u
#define SDHC_ADMAES_ADMADCE_SHIFT                3
/* ADSADDR Bit Fields */
#define SDHC_ADSADDR_ADSADDR_MASK                0xFFFFFFFCu
#define SDHC_ADSADDR_ADSADDR_SHIFT               2
#define SDHC_ADSADDR_ADSADDR(x)                  (((uint32_t)(((uint32_t)(x))<<SDHC_ADSADDR_ADSADDR_SHIFT))&SDHC_ADSADDR_ADSADDR_MASK)
/* VENDOR Bit Fields */
#define SDHC_VENDOR_EXTDMAEN_MASK                0x1u
#define SDHC_VENDOR_EXTDMAEN_SHIFT               0
#define SDHC_VENDOR_EXBLKNU_MASK                 0x2u
#define SDHC_VENDOR_EXBLKNU_SHIFT                1
#define SDHC_VENDOR_INTSTVAL_MASK                0xFF0000u
#define SDHC_VENDOR_INTSTVAL_SHIFT               16
#define SDHC_VENDOR_INTSTVAL(x)                  (((uint32_t)(((uint32_t)(x))<<SDHC_VENDOR_INTSTVAL_SHIFT))&SDHC_VENDOR_INTSTVAL_MASK)
/* MMCBOOT Bit Fields */
#define SDHC_MMCBOOT_DTOCVACK_MASK               0xFu
#define SDHC_MMCBOOT_DTOCVACK_SHIFT              0
#define SDHC_MMCBOOT_DTOCVACK(x)                 (((uint32_t)(((uint32_t)(x))<<SDHC_MMCBOOT_DTOCVACK_SHIFT))&SDHC_MMCBOOT_DTOCVACK_MASK)
#define SDHC_MMCBOOT_BOOTACK_MASK                0x10u
#define SDHC_MMCBOOT_BOOTACK_SHIFT               4
#define SDHC_MMCBOOT_BOOTMODE_MASK               0x20u
#define SDHC_MMCBOOT_BOOTMODE_SHIFT              5
#define SDHC_MMCBOOT_BOOTEN_MASK                 0x40u
#define SDHC_MMCBOOT_BOOTEN_SHIFT                6
#define SDHC_MMCBOOT_AUTOSABGEN_MASK             0x80u
#define SDHC_MMCBOOT_AUTOSABGEN_SHIFT            7
#define SDHC_MMCBOOT_BOOTBLKCNT_MASK             0xFFFF0000u
#define SDHC_MMCBOOT_BOOTBLKCNT_SHIFT            16
#define SDHC_MMCBOOT_BOOTBLKCNT(x)               (((uint32_t)(((uint32_t)(x))<<SDHC_MMCBOOT_BOOTBLKCNT_SHIFT))&SDHC_MMCBOOT_BOOTBLKCNT_MASK)
/* HOSTVER Bit Fields */
#define SDHC_HOSTVER_SVN_MASK                    0xFFu
#define SDHC_HOSTVER_SVN_SHIFT                   0
#define SDHC_HOSTVER_SVN(x)                      (((uint32_t)(((uint32_t)(x))<<SDHC_HOSTVER_SVN_SHIFT))&SDHC_HOSTVER_SVN_MASK)
#define SDHC_HOSTVER_VVN_MASK                    0xFF00u
#define SDHC_HOSTVER_VVN_SHIFT                   8
#define SDHC_HOSTVER_VVN(x)                      (((uint32_t)(((uint32_t)(x))<<SDHC_HOSTVER_VVN_SHIFT))&SDHC_HOSTVER_VVN_MASK)

/*!
 * @}
 */ /* end of group SDHC_Register_Masks */


/* SDHC - Peripheral instance base addresses */
/** Peripheral SDHC base pointer */
#define SDHC_BASE_PTR                            ((SDHC_MemMapPtr)0x400B1000u)
/** Array initializer of SDHC peripheral base pointers */
#define SDHC_BASE_PTRS                           { SDHC_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- SDHC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDHC_Register_Accessor_Macros SDHC - Register accessor macros
 * @{
 */


/* SDHC - Register instance definitions */
/* SDHC */
#define SDHC_DSADDR                              SDHC_DSADDR_REG(SDHC_BASE_PTR)
#define SDHC_BLKATTR                             SDHC_BLKATTR_REG(SDHC_BASE_PTR)
#define SDHC_CMDARG                              SDHC_CMDARG_REG(SDHC_BASE_PTR)
#define SDHC_XFERTYP                             SDHC_XFERTYP_REG(SDHC_BASE_PTR)
#define SDHC_CMDRSP0                             SDHC_CMDRSP_REG(SDHC_BASE_PTR,0)
#define SDHC_CMDRSP1                             SDHC_CMDRSP_REG(SDHC_BASE_PTR,1)
#define SDHC_CMDRSP2                             SDHC_CMDRSP_REG(SDHC_BASE_PTR,2)
#define SDHC_CMDRSP3                             SDHC_CMDRSP_REG(SDHC_BASE_PTR,3)
#define SDHC_DATPORT                             SDHC_DATPORT_REG(SDHC_BASE_PTR)
#define SDHC_PRSSTAT                             SDHC_PRSSTAT_REG(SDHC_BASE_PTR)
#define SDHC_PROCTL                              SDHC_PROCTL_REG(SDHC_BASE_PTR)
#define SDHC_SYSCTL                              SDHC_SYSCTL_REG(SDHC_BASE_PTR)
#define SDHC_IRQSTAT                             SDHC_IRQSTAT_REG(SDHC_BASE_PTR)
#define SDHC_IRQSTATEN                           SDHC_IRQSTATEN_REG(SDHC_BASE_PTR)
#define SDHC_IRQSIGEN                            SDHC_IRQSIGEN_REG(SDHC_BASE_PTR)
#define SDHC_AC12ERR                             SDHC_AC12ERR_REG(SDHC_BASE_PTR)
#define SDHC_HTCAPBLT                            SDHC_HTCAPBLT_REG(SDHC_BASE_PTR)
#define SDHC_WML                                 SDHC_WML_REG(SDHC_BASE_PTR)
#define SDHC_FEVT                                SDHC_FEVT_REG(SDHC_BASE_PTR)
#define SDHC_ADMAES                              SDHC_ADMAES_REG(SDHC_BASE_PTR)
#define SDHC_ADSADDR                             SDHC_ADSADDR_REG(SDHC_BASE_PTR)
#define SDHC_VENDOR                              SDHC_VENDOR_REG(SDHC_BASE_PTR)
#define SDHC_MMCBOOT                             SDHC_MMCBOOT_REG(SDHC_BASE_PTR)
#define SDHC_HOSTVER                             SDHC_HOSTVER_REG(SDHC_BASE_PTR)

/* SDHC - Register array accessors */
#define SDHC_CMDRSP(index)                       SDHC_CMDRSP_REG(SDHC_BASE_PTR,index)

/*!
 * @}
 */ /* end of group SDHC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group SDHC_Peripheral */


/* ----------------------------------------------------------------------------
   -- SDRAM
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDRAM_Peripheral SDRAM
 * @{
 */

/** SDRAM - Peripheral register structure */
typedef struct SDRAM_MemMap {
  uint8_t RESERVED_0[64];
  uint16_t CTRL;                                   /**< Control Register, offset: 0x40 */
  uint8_t RESERVED_1[6];
  struct {                                         /* offset: 0x48, array step: 0x8 */
    uint32_t AC;                                     /**< Address and Control Register, array offset: 0x48, array step: 0x8 */
    uint32_t CM;                                     /**< Control Mask, array offset: 0x4C, array step: 0x8 */
  } BLOCK[2];
} volatile *SDRAM_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- SDRAM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDRAM_Register_Accessor_Macros SDRAM - Register accessor macros
 * @{
 */


/* SDRAM - Register accessors */
#define SDRAM_CTRL_REG(base)                     ((base)->CTRL)
#define SDRAM_AC_REG(base,index)                 ((base)->BLOCK[index].AC)
#define SDRAM_CM_REG(base,index)                 ((base)->BLOCK[index].CM)

/*!
 * @}
 */ /* end of group SDRAM_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- SDRAM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDRAM_Register_Masks SDRAM Register Masks
 * @{
 */

/* CTRL Bit Fields */
#define SDRAM_CTRL_RC_MASK                       0x1FFu
#define SDRAM_CTRL_RC_SHIFT                      0
#define SDRAM_CTRL_RC(x)                         (((uint16_t)(((uint16_t)(x))<<SDRAM_CTRL_RC_SHIFT))&SDRAM_CTRL_RC_MASK)
#define SDRAM_CTRL_RTIM_MASK                     0x600u
#define SDRAM_CTRL_RTIM_SHIFT                    9
#define SDRAM_CTRL_RTIM(x)                       (((uint16_t)(((uint16_t)(x))<<SDRAM_CTRL_RTIM_SHIFT))&SDRAM_CTRL_RTIM_MASK)
#define SDRAM_CTRL_IS_MASK                       0x800u
#define SDRAM_CTRL_IS_SHIFT                      11
#define SDRAM_CTRL_COC_MASK                      0x1000u
#define SDRAM_CTRL_COC_SHIFT                     12
#define SDRAM_CTRL_NAM_MASK                      0x2000u
#define SDRAM_CTRL_NAM_SHIFT                     13
/* AC Bit Fields */
#define SDRAM_AC_IP_MASK                         0x8u
#define SDRAM_AC_IP_SHIFT                        3
#define SDRAM_AC_PS_MASK                         0x30u
#define SDRAM_AC_PS_SHIFT                        4
#define SDRAM_AC_PS(x)                           (((uint32_t)(((uint32_t)(x))<<SDRAM_AC_PS_SHIFT))&SDRAM_AC_PS_MASK)
#define SDRAM_AC_IMRS_MASK                       0x40u
#define SDRAM_AC_IMRS_SHIFT                      6
#define SDRAM_AC_CBM_MASK                        0x700u
#define SDRAM_AC_CBM_SHIFT                       8
#define SDRAM_AC_CBM(x)                          (((uint32_t)(((uint32_t)(x))<<SDRAM_AC_CBM_SHIFT))&SDRAM_AC_CBM_MASK)
#define SDRAM_AC_CASL_MASK                       0x3000u
#define SDRAM_AC_CASL_SHIFT                      12
#define SDRAM_AC_CASL(x)                         (((uint32_t)(((uint32_t)(x))<<SDRAM_AC_CASL_SHIFT))&SDRAM_AC_CASL_MASK)
#define SDRAM_AC_RE_MASK                         0x8000u
#define SDRAM_AC_RE_SHIFT                        15
#define SDRAM_AC_BA_MASK                         0xFFFC0000u
#define SDRAM_AC_BA_SHIFT                        18
#define SDRAM_AC_BA(x)                           (((uint32_t)(((uint32_t)(x))<<SDRAM_AC_BA_SHIFT))&SDRAM_AC_BA_MASK)
/* CM Bit Fields */
#define SDRAM_CM_V_MASK                          0x1u
#define SDRAM_CM_V_SHIFT                         0
#define SDRAM_CM_WP_MASK                         0x100u
#define SDRAM_CM_WP_SHIFT                        8
#define SDRAM_CM_BAM_MASK                        0xFFFC0000u
#define SDRAM_CM_BAM_SHIFT                       18
#define SDRAM_CM_BAM(x)                          (((uint32_t)(((uint32_t)(x))<<SDRAM_CM_BAM_SHIFT))&SDRAM_CM_BAM_MASK)

/*!
 * @}
 */ /* end of group SDRAM_Register_Masks */


/* SDRAM - Peripheral instance base addresses */
/** Peripheral SDRAM base pointer */
#define SDRAM_BASE_PTR                           ((SDRAM_MemMapPtr)0x4000F000u)
/** Array initializer of SDRAM peripheral base pointers */
#define SDRAM_BASE_PTRS                          { SDRAM_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- SDRAM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDRAM_Register_Accessor_Macros SDRAM - Register accessor macros
 * @{
 */


