kcuzner/teensy-oscilloscope/scope-teensy/include/MK65F18WS.h
#define USBHS_OTGSC_VD_MASK                      0x1u
#define USBHS_OTGSC_VD_SHIFT                     0
#define USBHS_OTGSC_VC_MASK                      0x2u
#define USBHS_OTGSC_VC_SHIFT                     1
#define USBHS_OTGSC_HAAR_MASK                    0x4u
#define USBHS_OTGSC_HAAR_SHIFT                   2
#define USBHS_OTGSC_OT_MASK                      0x8u
#define USBHS_OTGSC_OT_SHIFT                     3
#define USBHS_OTGSC_DP_MASK                      0x10u
#define USBHS_OTGSC_DP_SHIFT                     4
#define USBHS_OTGSC_IDPU_MASK                    0x20u
#define USBHS_OTGSC_IDPU_SHIFT                   5
#define USBHS_OTGSC_HABA_MASK                    0x80u
#define USBHS_OTGSC_HABA_SHIFT                   7
#define USBHS_OTGSC_ID_MASK                      0x100u
#define USBHS_OTGSC_ID_SHIFT                     8
#define USBHS_OTGSC_AVV_MASK                     0x200u
#define USBHS_OTGSC_AVV_SHIFT                    9
#define USBHS_OTGSC_ASV_MASK                     0x400u
#define USBHS_OTGSC_ASV_SHIFT                    10
#define USBHS_OTGSC_BSV_MASK                     0x800u
#define USBHS_OTGSC_BSV_SHIFT                    11
#define USBHS_OTGSC_BSE_MASK                     0x1000u
#define USBHS_OTGSC_BSE_SHIFT                    12
#define USBHS_OTGSC_MST_MASK                     0x2000u
#define USBHS_OTGSC_MST_SHIFT                    13
#define USBHS_OTGSC_DPS_MASK                     0x4000u
#define USBHS_OTGSC_DPS_SHIFT                    14
#define USBHS_OTGSC_IDIS_MASK                    0x10000u
#define USBHS_OTGSC_IDIS_SHIFT                   16
#define USBHS_OTGSC_AVVIS_MASK                   0x20000u
#define USBHS_OTGSC_AVVIS_SHIFT                  17
#define USBHS_OTGSC_ASVIS_MASK                   0x40000u
#define USBHS_OTGSC_ASVIS_SHIFT                  18
#define USBHS_OTGSC_BSVIS_MASK                   0x80000u
#define USBHS_OTGSC_BSVIS_SHIFT                  19
#define USBHS_OTGSC_BSEIS_MASK                   0x100000u
#define USBHS_OTGSC_BSEIS_SHIFT                  20
#define USBHS_OTGSC_MSS_MASK                     0x200000u
#define USBHS_OTGSC_MSS_SHIFT                    21
#define USBHS_OTGSC_DPIS_MASK                    0x400000u
#define USBHS_OTGSC_DPIS_SHIFT                   22
#define USBHS_OTGSC_IDIE_MASK                    0x1000000u
#define USBHS_OTGSC_IDIE_SHIFT                   24
#define USBHS_OTGSC_AVVIE_MASK                   0x2000000u
#define USBHS_OTGSC_AVVIE_SHIFT                  25
#define USBHS_OTGSC_ASVIE_MASK                   0x4000000u
#define USBHS_OTGSC_ASVIE_SHIFT                  26
#define USBHS_OTGSC_BSVIE_MASK                   0x8000000u
#define USBHS_OTGSC_BSVIE_SHIFT                  27
#define USBHS_OTGSC_BSEIE_MASK                   0x10000000u
#define USBHS_OTGSC_BSEIE_SHIFT                  28
#define USBHS_OTGSC_MSE_MASK                     0x20000000u
#define USBHS_OTGSC_MSE_SHIFT                    29
#define USBHS_OTGSC_DPIE_MASK                    0x40000000u
#define USBHS_OTGSC_DPIE_SHIFT                   30
/* USBMODE Bit Fields */
#define USBHS_USBMODE_CM_MASK                    0x3u
#define USBHS_USBMODE_CM_SHIFT                   0
#define USBHS_USBMODE_CM(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBMODE_CM_SHIFT))&USBHS_USBMODE_CM_MASK)
#define USBHS_USBMODE_ES_MASK                    0x4u
#define USBHS_USBMODE_ES_SHIFT                   2
#define USBHS_USBMODE_SLOM_MASK                  0x8u
#define USBHS_USBMODE_SLOM_SHIFT                 3
#define USBHS_USBMODE_SDIS_MASK                  0x10u
#define USBHS_USBMODE_SDIS_SHIFT                 4
#define USBHS_USBMODE_TXHSD_MASK                 0x7000u
#define USBHS_USBMODE_TXHSD_SHIFT                12
#define USBHS_USBMODE_TXHSD(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_USBMODE_TXHSD_SHIFT))&USBHS_USBMODE_TXHSD_MASK)
/* EPSETUPSR Bit Fields */
#define USBHS_EPSETUPSR_EPSETUPSTAT_MASK         0xFu
#define USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT        0
#define USBHS_EPSETUPSR_EPSETUPSTAT(x)           (((uint32_t)(((uint32_t)(x))<<USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT))&USBHS_EPSETUPSR_EPSETUPSTAT_MASK)
/* EPPRIME Bit Fields */
#define USBHS_EPPRIME_PERB_MASK                  0xFu
#define USBHS_EPPRIME_PERB_SHIFT                 0
#define USBHS_EPPRIME_PERB(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_EPPRIME_PERB_SHIFT))&USBHS_EPPRIME_PERB_MASK)
#define USBHS_EPPRIME_PETB_MASK                  0xF0000u
#define USBHS_EPPRIME_PETB_SHIFT                 16
#define USBHS_EPPRIME_PETB(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_EPPRIME_PETB_SHIFT))&USBHS_EPPRIME_PETB_MASK)
/* EPFLUSH Bit Fields */
#define USBHS_EPFLUSH_FERB_MASK                  0xFu
#define USBHS_EPFLUSH_FERB_SHIFT                 0
#define USBHS_EPFLUSH_FERB(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_EPFLUSH_FERB_SHIFT))&USBHS_EPFLUSH_FERB_MASK)
#define USBHS_EPFLUSH_FETB_MASK                  0xF0000u
#define USBHS_EPFLUSH_FETB_SHIFT                 16
#define USBHS_EPFLUSH_FETB(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_EPFLUSH_FETB_SHIFT))&USBHS_EPFLUSH_FETB_MASK)
/* EPSR Bit Fields */
#define USBHS_EPSR_ERBR_MASK                     0xFu
#define USBHS_EPSR_ERBR_SHIFT                    0
#define USBHS_EPSR_ERBR(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPSR_ERBR_SHIFT))&USBHS_EPSR_ERBR_MASK)
#define USBHS_EPSR_ETBR_MASK                     0xF0000u
#define USBHS_EPSR_ETBR_SHIFT                    16
#define USBHS_EPSR_ETBR(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPSR_ETBR_SHIFT))&USBHS_EPSR_ETBR_MASK)
/* EPCOMPLETE Bit Fields */
#define USBHS_EPCOMPLETE_ERCE_MASK               0xFu
#define USBHS_EPCOMPLETE_ERCE_SHIFT              0
#define USBHS_EPCOMPLETE_ERCE(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_EPCOMPLETE_ERCE_SHIFT))&USBHS_EPCOMPLETE_ERCE_MASK)
#define USBHS_EPCOMPLETE_ETCE_MASK               0xF0000u
#define USBHS_EPCOMPLETE_ETCE_SHIFT              16
#define USBHS_EPCOMPLETE_ETCE(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_EPCOMPLETE_ETCE_SHIFT))&USBHS_EPCOMPLETE_ETCE_MASK)
/* EPCR0 Bit Fields */
#define USBHS_EPCR0_RXS_MASK                     0x1u
#define USBHS_EPCR0_RXS_SHIFT                    0
#define USBHS_EPCR0_RXT_MASK                     0xCu
#define USBHS_EPCR0_RXT_SHIFT                    2
#define USBHS_EPCR0_RXT(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR0_RXT_SHIFT))&USBHS_EPCR0_RXT_MASK)
#define USBHS_EPCR0_RXE_MASK                     0x80u
#define USBHS_EPCR0_RXE_SHIFT                    7
#define USBHS_EPCR0_TXS_MASK                     0x10000u
#define USBHS_EPCR0_TXS_SHIFT                    16
#define USBHS_EPCR0_TXT_MASK                     0xC0000u
#define USBHS_EPCR0_TXT_SHIFT                    18
#define USBHS_EPCR0_TXT(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR0_TXT_SHIFT))&USBHS_EPCR0_TXT_MASK)
#define USBHS_EPCR0_TXE_MASK                     0x800000u
#define USBHS_EPCR0_TXE_SHIFT                    23
/* EPCR Bit Fields */
#define USBHS_EPCR_RXS_MASK                      0x1u
#define USBHS_EPCR_RXS_SHIFT                     0
#define USBHS_EPCR_RXD_MASK                      0x2u
#define USBHS_EPCR_RXD_SHIFT                     1
#define USBHS_EPCR_RXT_MASK                      0xCu
#define USBHS_EPCR_RXT_SHIFT                     2
#define USBHS_EPCR_RXT(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_RXT_SHIFT))&USBHS_EPCR_RXT_MASK)
#define USBHS_EPCR_RXI_MASK                      0x20u
#define USBHS_EPCR_RXI_SHIFT                     5
#define USBHS_EPCR_RXR_MASK                      0x40u
#define USBHS_EPCR_RXR_SHIFT                     6
#define USBHS_EPCR_RXE_MASK                      0x80u
#define USBHS_EPCR_RXE_SHIFT                     7
#define USBHS_EPCR_TXS_MASK                      0x10000u
#define USBHS_EPCR_TXS_SHIFT                     16
#define USBHS_EPCR_TXD_MASK                      0x20000u
#define USBHS_EPCR_TXD_SHIFT                     17
#define USBHS_EPCR_TXT_MASK                      0xC0000u
#define USBHS_EPCR_TXT_SHIFT                     18
#define USBHS_EPCR_TXT(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_TXT_SHIFT))&USBHS_EPCR_TXT_MASK)
#define USBHS_EPCR_TXI_MASK                      0x200000u
#define USBHS_EPCR_TXI_SHIFT                     21
#define USBHS_EPCR_TXR_MASK                      0x400000u
#define USBHS_EPCR_TXR_SHIFT                     22
#define USBHS_EPCR_TXE_MASK                      0x800000u
#define USBHS_EPCR_TXE_SHIFT                     23
/* USBGENCTRL Bit Fields */
#define USBHS_USBGENCTRL_WU_IE_MASK              0x1u
#define USBHS_USBGENCTRL_WU_IE_SHIFT             0
#define USBHS_USBGENCTRL_WU_INT_CLR_MASK         0x20u
#define USBHS_USBGENCTRL_WU_INT_CLR_SHIFT        5

/*!
 * @}
 */ /* end of group USBHS_Register_Masks */


/* USBHS - Peripheral instance base addresses */
/** Peripheral USBHS base pointer */
#define USBHS_BASE_PTR                           ((USBHS_MemMapPtr)0x400A1000u)
/** Array initializer of USBHS peripheral base pointers */
#define USBHS_BASE_PTRS                          { USBHS_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- USBHS - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBHS_Register_Accessor_Macros USBHS - Register accessor macros
 * @{
 */


/* USBHS - Register instance definitions */
/* USBHS */
#define USBHS_ID                                 USBHS_ID_REG(USBHS_BASE_PTR)
#define USBHS_HWGENERAL                          USBHS_HWGENERAL_REG(USBHS_BASE_PTR)
#define USBHS_HWHOST                             USBHS_HWHOST_REG(USBHS_BASE_PTR)
#define USBHS_HWDEVICE                           USBHS_HWDEVICE_REG(USBHS_BASE_PTR)
#define USBHS_HWTXBUF                            USBHS_HWTXBUF_REG(USBHS_BASE_PTR)
#define USBHS_HWRXBUF                            USBHS_HWRXBUF_REG(USBHS_BASE_PTR)
#define USBHS_GPTIMER0LD                         USBHS_GPTIMER0LD_REG(USBHS_BASE_PTR)
#define USBHS_GPTIMER0CTL                        USBHS_GPTIMER0CTL_REG(USBHS_BASE_PTR)
#define USBHS_GPTIMER1LD                         USBHS_GPTIMER1LD_REG(USBHS_BASE_PTR)
#define USBHS_GPTIMER1CTL                        USBHS_GPTIMER1CTL_REG(USBHS_BASE_PTR)
#define USBHS_USB_SBUSCFG                        USBHS_USB_SBUSCFG_REG(USBHS_BASE_PTR)
#define USBHS_HCIVERSION                         USBHS_HCIVERSION_REG(USBHS_BASE_PTR)
#define USBHS_HCSPARAMS                          USBHS_HCSPARAMS_REG(USBHS_BASE_PTR)
#define USBHS_HCCPARAMS                          USBHS_HCCPARAMS_REG(USBHS_BASE_PTR)
#define USBHS_DCIVERSION                         USBHS_DCIVERSION_REG(USBHS_BASE_PTR)
#define USBHS_DCCPARAMS                          USBHS_DCCPARAMS_REG(USBHS_BASE_PTR)
#define USBHS_USBCMD                             USBHS_USBCMD_REG(USBHS_BASE_PTR)
#define USBHS_USBSTS                             USBHS_USBSTS_REG(USBHS_BASE_PTR)
#define USBHS_USBINTR                            USBHS_USBINTR_REG(USBHS_BASE_PTR)
#define USBHS_FRINDEX                            USBHS_FRINDEX_REG(USBHS_BASE_PTR)
#define USBHS_DEVICEADDR                         USBHS_DEVICEADDR_REG(USBHS_BASE_PTR)
#define USBHS_PERIODICLISTBASE                   USBHS_PERIODICLISTBASE_REG(USBHS_BASE_PTR)
#define USBHS_ASYNCLISTADDR                      USBHS_ASYNCLISTADDR_REG(USBHS_BASE_PTR)
#define USBHS_EPLISTADDR                         USBHS_EPLISTADDR_REG(USBHS_BASE_PTR)
#define USBHS_TTCTRL                             USBHS_TTCTRL_REG(USBHS_BASE_PTR)
#define USBHS_BURSTSIZE                          USBHS_BURSTSIZE_REG(USBHS_BASE_PTR)
#define USBHS_TXFILLTUNING                       USBHS_TXFILLTUNING_REG(USBHS_BASE_PTR)
#define USBHS_ENDPTNAK                           USBHS_ENDPTNAK_REG(USBHS_BASE_PTR)
#define USBHS_ENDPTNAKEN                         USBHS_ENDPTNAKEN_REG(USBHS_BASE_PTR)
#define USBHS_CONFIGFLAG                         USBHS_CONFIGFLAG_REG(USBHS_BASE_PTR)
#define USBHS_PORTSC1                            USBHS_PORTSC1_REG(USBHS_BASE_PTR)
#define USBHS_OTGSC                              USBHS_OTGSC_REG(USBHS_BASE_PTR)
#define USBHS_USBMODE                            USBHS_USBMODE_REG(USBHS_BASE_PTR)
#define USBHS_EPSETUPSR                          USBHS_EPSETUPSR_REG(USBHS_BASE_PTR)
#define USBHS_EPPRIME                            USBHS_EPPRIME_REG(USBHS_BASE_PTR)
#define USBHS_EPFLUSH                            USBHS_EPFLUSH_REG(USBHS_BASE_PTR)
#define USBHS_EPSR                               USBHS_EPSR_REG(USBHS_BASE_PTR)
#define USBHS_EPCOMPLETE                         USBHS_EPCOMPLETE_REG(USBHS_BASE_PTR)
#define USBHS_EPCR0                              USBHS_EPCR0_REG(USBHS_BASE_PTR)
#define USBHS_EPCR1                              USBHS_EPCR_REG(USBHS_BASE_PTR,0)
#define USBHS_EPCR2                              USBHS_EPCR_REG(USBHS_BASE_PTR,1)
#define USBHS_EPCR3                              USBHS_EPCR_REG(USBHS_BASE_PTR,2)
#define USBHS_EPCR4                              USBHS_EPCR_REG(USBHS_BASE_PTR,3)
#define USBHS_EPCR5                              USBHS_EPCR_REG(USBHS_BASE_PTR,4)
#define USBHS_EPCR6                              USBHS_EPCR_REG(USBHS_BASE_PTR,5)
#define USBHS_EPCR7                              USBHS_EPCR_REG(USBHS_BASE_PTR,6)
#define USBHS_USBGENCTRL                         USBHS_USBGENCTRL_REG(USBHS_BASE_PTR)

/* USBHS - Register array accessors */
#define USBHS_EPCR(index)                        USBHS_EPCR_REG(USBHS_BASE_PTR,index)

/*!
 * @}
 */ /* end of group USBHS_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group USBHS_Peripheral */


/* ----------------------------------------------------------------------------
   -- USBHSDCD
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBHSDCD_Peripheral USBHSDCD
 * @{
 */

/** USBHSDCD - Peripheral register structure */
typedef struct USBHSDCD_MemMap {
  uint32_t CONTROL;                                /**< Control register, offset: 0x0 */
  uint32_t CLOCK;                                  /**< Clock register, offset: 0x4 */
  uint32_t STATUS;                                 /**< Status register, offset: 0x8 */
  uint8_t RESERVED_0[4];
  uint32_t TIMER0;                                 /**< TIMER0 register, offset: 0x10 */
  uint32_t TIMER1;                                 /**< TIMER1 register, offset: 0x14 */
  union {                                          /* offset: 0x18 */
    uint32_t TIMER2_BC11;                            /**< TIMER2_BC11 register, offset: 0x18 */
    uint32_t TIMER2_BC12;                            /**< TIMER2_BC12 register, offset: 0x18 */
  };
} volatile *USBHSDCD_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- USBHSDCD - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBHSDCD_Register_Accessor_Macros USBHSDCD - Register accessor macros
 * @{
 */


/* USBHSDCD - Register accessors */
#define USBHSDCD_CONTROL_REG(base)               ((base)->CONTROL)
#define USBHSDCD_CLOCK_REG(base)                 ((base)->CLOCK)
#define USBHSDCD_STATUS_REG(base)                ((base)->STATUS)
#define USBHSDCD_TIMER0_REG(base)                ((base)->TIMER0)
#define USBHSDCD_TIMER1_REG(base)                ((base)->TIMER1)
#define USBHSDCD_TIMER2_BC11_REG(base)           ((base)->TIMER2_BC11)
#define USBHSDCD_TIMER2_BC12_REG(base)           ((base)->TIMER2_BC12)

/*!
 * @}
 */ /* end of group USBHSDCD_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- USBHSDCD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBHSDCD_Register_Masks USBHSDCD Register Masks
 * @{
 */

/* CONTROL Bit Fields */
#define USBHSDCD_CONTROL_IACK_MASK               0x1u
#define USBHSDCD_CONTROL_IACK_SHIFT              0
#define USBHSDCD_CONTROL_IF_MASK                 0x100u
#define USBHSDCD_CONTROL_IF_SHIFT                8
#define USBHSDCD_CONTROL_IE_MASK                 0x10000u
#define USBHSDCD_CONTROL_IE_SHIFT                16
#define USBHSDCD_CONTROL_BC12_MASK               0x20000u
#define USBHSDCD_CONTROL_BC12_SHIFT              17
#define USBHSDCD_CONTROL_START_MASK              0x1000000u
#define USBHSDCD_CONTROL_START_SHIFT             24
#define USBHSDCD_CONTROL_SR_MASK                 0x2000000u
#define USBHSDCD_CONTROL_SR_SHIFT                25
/* CLOCK Bit Fields */
#define USBHSDCD_CLOCK_CLOCK_UNIT_MASK           0x1u
#define USBHSDCD_CLOCK_CLOCK_UNIT_SHIFT          0
#define USBHSDCD_CLOCK_CLOCK_SPEED_MASK          0xFFCu
#define USBHSDCD_CLOCK_CLOCK_SPEED_SHIFT         2
#define USBHSDCD_CLOCK_CLOCK_SPEED(x)            (((uint32_t)(((uint32_t)(x))<<USBHSDCD_CLOCK_CLOCK_SPEED_SHIFT))&USBHSDCD_CLOCK_CLOCK_SPEED_MASK)
/* STATUS Bit Fields */
#define USBHSDCD_STATUS_SEQ_RES_MASK             0x30000u
#define USBHSDCD_STATUS_SEQ_RES_SHIFT            16
#define USBHSDCD_STATUS_SEQ_RES(x)               (((uint32_t)(((uint32_t)(x))<<USBHSDCD_STATUS_SEQ_RES_SHIFT))&USBHSDCD_STATUS_SEQ_RES_MASK)
#define USBHSDCD_STATUS_SEQ_STAT_MASK            0xC0000u
#define USBHSDCD_STATUS_SEQ_STAT_SHIFT           18
#define USBHSDCD_STATUS_SEQ_STAT(x)              (((uint32_t)(((uint32_t)(x))<<USBHSDCD_STATUS_SEQ_STAT_SHIFT))&USBHSDCD_STATUS_SEQ_STAT_MASK)
#define USBHSDCD_STATUS_ERR_MASK                 0x100000u
#define USBHSDCD_STATUS_ERR_SHIFT                20
#define USBHSDCD_STATUS_TO_MASK                  0x200000u
#define USBHSDCD_STATUS_TO_SHIFT                 21
#define USBHSDCD_STATUS_ACTIVE_MASK              0x400000u
#define USBHSDCD_STATUS_ACTIVE_SHIFT             22
/* TIMER0 Bit Fields */
#define USBHSDCD_TIMER0_TUNITCON_MASK            0xFFFu
#define USBHSDCD_TIMER0_TUNITCON_SHIFT           0
#define USBHSDCD_TIMER0_TUNITCON(x)              (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER0_TUNITCON_SHIFT))&USBHSDCD_TIMER0_TUNITCON_MASK)
#define USBHSDCD_TIMER0_TSEQ_INIT_MASK           0x3FF0000u
#define USBHSDCD_TIMER0_TSEQ_INIT_SHIFT          16
#define USBHSDCD_TIMER0_TSEQ_INIT(x)             (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER0_TSEQ_INIT_SHIFT))&USBHSDCD_TIMER0_TSEQ_INIT_MASK)
/* TIMER1 Bit Fields */
#define USBHSDCD_TIMER1_TVDPSRC_ON_MASK          0x3FFu
#define USBHSDCD_TIMER1_TVDPSRC_ON_SHIFT         0
#define USBHSDCD_TIMER1_TVDPSRC_ON(x)            (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER1_TVDPSRC_ON_SHIFT))&USBHSDCD_TIMER1_TVDPSRC_ON_MASK)
#define USBHSDCD_TIMER1_TDCD_DBNC_MASK           0x3FF0000u
#define USBHSDCD_TIMER1_TDCD_DBNC_SHIFT          16
#define USBHSDCD_TIMER1_TDCD_DBNC(x)             (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER1_TDCD_DBNC_SHIFT))&USBHSDCD_TIMER1_TDCD_DBNC_MASK)
/* TIMER2_BC11 Bit Fields */
#define USBHSDCD_TIMER2_BC11_CHECK_DM_MASK       0xFu
#define USBHSDCD_TIMER2_BC11_CHECK_DM_SHIFT      0
#define USBHSDCD_TIMER2_BC11_CHECK_DM(x)         (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER2_BC11_CHECK_DM_SHIFT))&USBHSDCD_TIMER2_BC11_CHECK_DM_MASK)
#define USBHSDCD_TIMER2_BC11_TVDPSRC_CON_MASK    0x3FF0000u
#define USBHSDCD_TIMER2_BC11_TVDPSRC_CON_SHIFT   16
#define USBHSDCD_TIMER2_BC11_TVDPSRC_CON(x)      (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER2_BC11_TVDPSRC_CON_SHIFT))&USBHSDCD_TIMER2_BC11_TVDPSRC_CON_MASK)
/* TIMER2_BC12 Bit Fields */
#define USBHSDCD_TIMER2_BC12_TVDMSRC_ON_MASK     0x3FFu
#define USBHSDCD_TIMER2_BC12_TVDMSRC_ON_SHIFT    0
#define USBHSDCD_TIMER2_BC12_TVDMSRC_ON(x)       (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER2_BC12_TVDMSRC_ON_SHIFT))&USBHSDCD_TIMER2_BC12_TVDMSRC_ON_MASK)
#define USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD_MASK 0x3FF0000u
#define USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD_SHIFT 16
#define USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD(x)  (((uint32_t)(((uint32_t)(x))<<USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD_SHIFT))&USBHSDCD_TIMER2_BC12_TWAIT_AFTER_PRD_MASK)

/*!
 * @}
 */ /* end of group USBHSDCD_Register_Masks */


/* USBHSDCD - Peripheral instance base addresses */
/** Peripheral USBHSDCD base pointer */
#define USBHSDCD_BASE_PTR                        ((USBHSDCD_MemMapPtr)0x400A3000u)
/** Array initializer of USBHSDCD peripheral base pointers */
#define USBHSDCD_BASE_PTRS                       { USBHSDCD_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- USBHSDCD - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBHSDCD_Register_Accessor_Macros USBHSDCD - Register accessor macros
 * @{
 */


/* USBHSDCD - Register instance definitions */
/* USBHSDCD */
#define USBHSDCD_CONTROL                         USBHSDCD_CONTROL_REG(USBHSDCD_BASE_PTR)
#define USBHSDCD_CLOCK                           USBHSDCD_CLOCK_REG(USBHSDCD_BASE_PTR)
#define USBHSDCD_STATUS                          USBHSDCD_STATUS_REG(USBHSDCD_BASE_PTR)
#define USBHSDCD_TIMER0                          USBHSDCD_TIMER0_REG(USBHSDCD_BASE_PTR)
#define USBHSDCD_TIMER1                          USBHSDCD_TIMER1_REG(USBHSDCD_BASE_PTR)
#define USBHSDCD_TIMER2_BC11                     USBHSDCD_TIMER2_BC11_REG(USBHSDCD_BASE_PTR)
#define USBHSDCD_TIMER2_BC12                     USBHSDCD_TIMER2_BC12_REG(USBHSDCD_BASE_PTR)

/*!
 * @}
 */ /* end of group USBHSDCD_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group USBHSDCD_Peripheral */


/* ----------------------------------------------------------------------------
   -- USBPHY
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBPHY_Peripheral USBPHY
 * @{
 */

