kcuzner/teensy-oscilloscope/scope-teensy/include/MK65F18WS.h
/** USBPHY - Peripheral register structure */
typedef struct USBPHY_MemMap {
  uint32_t PWD;                                    /**< USB PHY Power-Down Register, offset: 0x0 */
  uint32_t PWD_SET;                                /**< USB PHY Power-Down Register, offset: 0x4 */
  uint32_t PWD_CLR;                                /**< USB PHY Power-Down Register, offset: 0x8 */
  uint32_t PWD_TOG;                                /**< USB PHY Power-Down Register, offset: 0xC */
  uint32_t TX;                                     /**< USB PHY Transmitter Control Register, offset: 0x10 */
  uint32_t TX_SET;                                 /**< USB PHY Transmitter Control Register, offset: 0x14 */
  uint32_t TX_CLR;                                 /**< USB PHY Transmitter Control Register, offset: 0x18 */
  uint32_t TX_TOG;                                 /**< USB PHY Transmitter Control Register, offset: 0x1C */
  uint32_t RX;                                     /**< USB PHY Receiver Control Register, offset: 0x20 */
  uint32_t RX_SET;                                 /**< USB PHY Receiver Control Register, offset: 0x24 */
  uint32_t RX_CLR;                                 /**< USB PHY Receiver Control Register, offset: 0x28 */
  uint32_t RX_TOG;                                 /**< USB PHY Receiver Control Register, offset: 0x2C */
  uint32_t CTRL;                                   /**< USB PHY General Control Register, offset: 0x30 */
  uint32_t CTRL_SET;                               /**< USB PHY General Control Register, offset: 0x34 */
  uint32_t CTRL_CLR;                               /**< USB PHY General Control Register, offset: 0x38 */
  uint32_t CTRL_TOG;                               /**< USB PHY General Control Register, offset: 0x3C */
  uint32_t STATUS;                                 /**< USB PHY Status Register, offset: 0x40 */
  uint8_t RESERVED_0[12];
  uint32_t DEBUG;                                  /**< USB PHY Debug Register, offset: 0x50 */
  uint32_t DEBUG_SET;                              /**< USB PHY Debug Register, offset: 0x54 */
  uint32_t DEBUG_CLR;                              /**< USB PHY Debug Register, offset: 0x58 */
  uint32_t DEBUG_TOG;                              /**< USB PHY Debug Register, offset: 0x5C */
  uint32_t DEBUG0_STATUS;                          /**< UTMI Debug Status Register 0, offset: 0x60 */
  uint8_t RESERVED_1[12];
  uint32_t DEBUG1;                                 /**< UTMI Debug Status Register 1, offset: 0x70 */
  uint32_t DEBUG1_SET;                             /**< UTMI Debug Status Register 1, offset: 0x74 */
  uint32_t DEBUG1_CLR;                             /**< UTMI Debug Status Register 1, offset: 0x78 */
  uint32_t DEBUG1_TOG;                             /**< UTMI Debug Status Register 1, offset: 0x7C */
  uint32_t VERSION;                                /**< UTMI RTL Version, offset: 0x80 */
  uint8_t RESERVED_2[28];
  uint32_t PLL_SIC;                                /**< USB PHY PLL Control/Status Register, offset: 0xA0 */
  uint32_t PLL_SIC_SET;                            /**< USB PHY PLL Control/Status Register, offset: 0xA4 */
  uint32_t PLL_SIC_CLR;                            /**< USB PHY PLL Control/Status Register, offset: 0xA8 */
  uint32_t PLL_SIC_TOG;                            /**< USB PHY PLL Control/Status Register, offset: 0xAC */
  uint8_t RESERVED_3[16];
  uint32_t USB1_VBUS_DETECT;                       /**< USB PHY VBUS Detect Control Register, offset: 0xC0 */
  uint32_t USB1_VBUS_DETECT_SET;                   /**< USB PHY VBUS Detect Control Register, offset: 0xC4 */
  uint32_t USB1_VBUS_DETECT_CLR;                   /**< USB PHY VBUS Detect Control Register, offset: 0xC8 */
  uint32_t USB1_VBUS_DETECT_TOG;                   /**< USB PHY VBUS Detect Control Register, offset: 0xCC */
  uint32_t USB1_VBUS_DET_STAT;                     /**< USB PHY VBUS Detector Status Register, offset: 0xD0 */
  uint8_t RESERVED_4[44];
  uint32_t ANACTRL;                                /**< USB PHY Analog Control Register, offset: 0x100 */
  uint32_t ANACTRL_SET;                            /**< USB PHY Analog Control Register, offset: 0x104 */
  uint32_t ANACTRL_CLR;                            /**< USB PHY Analog Control Register, offset: 0x108 */
  uint32_t ANACTRL_TOG;                            /**< USB PHY Analog Control Register, offset: 0x10C */
  uint32_t USB1_LOOPBACK;                          /**< USB PHY Loopback Control/Status Register, offset: 0x110 */
  uint32_t USB1_LOOPBACK_SET;                      /**< USB PHY Loopback Control/Status Register, offset: 0x114 */
  uint32_t USB1_LOOPBACK_CLR;                      /**< USB PHY Loopback Control/Status Register, offset: 0x118 */
  uint32_t USB1_LOOPBACK_TOG;                      /**< USB PHY Loopback Control/Status Register, offset: 0x11C */
  uint32_t USB1_LOOPBACK_HSFSCNT;                  /**< USB PHY Loopback Packet Number Select Register, offset: 0x120 */
  uint32_t USB1_LOOPBACK_HSFSCNT_SET;              /**< USB PHY Loopback Packet Number Select Register, offset: 0x124 */
  uint32_t USB1_LOOPBACK_HSFSCNT_CLR;              /**< USB PHY Loopback Packet Number Select Register, offset: 0x128 */
  uint32_t USB1_LOOPBACK_HSFSCNT_TOG;              /**< USB PHY Loopback Packet Number Select Register, offset: 0x12C */
  uint32_t TRIM_OVERRIDE_EN;                       /**< USB PHY Trim Override Enable Register, offset: 0x130 */
  uint32_t TRIM_OVERRIDE_EN_SET;                   /**< USB PHY Trim Override Enable Register, offset: 0x134 */
  uint32_t TRIM_OVERRIDE_EN_CLR;                   /**< USB PHY Trim Override Enable Register, offset: 0x138 */
  uint32_t TRIM_OVERRIDE_EN_TOG;                   /**< USB PHY Trim Override Enable Register, offset: 0x13C */
} volatile *USBPHY_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- USBPHY - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBPHY_Register_Accessor_Macros USBPHY - Register accessor macros
 * @{
 */


