kcuzner/teensy-oscilloscope/scope-teensy/include/MK65F18WS.h
#define USBPHY_DEBUG_SET_ENTX2RXCOUNT_SHIFT      12
#define USBPHY_DEBUG_SET_SQUELCHRESETCOUNT_MASK  0x1F0000u
#define USBPHY_DEBUG_SET_SQUELCHRESETCOUNT_SHIFT 16
#define USBPHY_DEBUG_SET_SQUELCHRESETCOUNT(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_SET_SQUELCHRESETCOUNT_SHIFT))&USBPHY_DEBUG_SET_SQUELCHRESETCOUNT_MASK)
#define USBPHY_DEBUG_SET_ENSQUELCHRESET_MASK     0x1000000u
#define USBPHY_DEBUG_SET_ENSQUELCHRESET_SHIFT    24
#define USBPHY_DEBUG_SET_SQUELCHRESETLENGTH_MASK 0x1E000000u
#define USBPHY_DEBUG_SET_SQUELCHRESETLENGTH_SHIFT 25
#define USBPHY_DEBUG_SET_SQUELCHRESETLENGTH(x)   (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_SET_SQUELCHRESETLENGTH_SHIFT))&USBPHY_DEBUG_SET_SQUELCHRESETLENGTH_MASK)
#define USBPHY_DEBUG_SET_HOST_RESUME_DEBUG_MASK  0x20000000u
#define USBPHY_DEBUG_SET_HOST_RESUME_DEBUG_SHIFT 29
#define USBPHY_DEBUG_SET_CLKGATE_MASK            0x40000000u
#define USBPHY_DEBUG_SET_CLKGATE_SHIFT           30
/* DEBUG_CLR Bit Fields */
#define USBPHY_DEBUG_CLR_OTGIDPIOLOCK_MASK       0x1u
#define USBPHY_DEBUG_CLR_OTGIDPIOLOCK_SHIFT      0
#define USBPHY_DEBUG_CLR_DEBUG_INTERFACE_HOLD_MASK 0x2u
#define USBPHY_DEBUG_CLR_DEBUG_INTERFACE_HOLD_SHIFT 1
#define USBPHY_DEBUG_CLR_HSTPULLDOWN_MASK        0xCu
#define USBPHY_DEBUG_CLR_HSTPULLDOWN_SHIFT       2
#define USBPHY_DEBUG_CLR_HSTPULLDOWN(x)          (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_HSTPULLDOWN_SHIFT))&USBPHY_DEBUG_CLR_HSTPULLDOWN_MASK)
#define USBPHY_DEBUG_CLR_ENHSTPULLDOWN_MASK      0x30u
#define USBPHY_DEBUG_CLR_ENHSTPULLDOWN_SHIFT     4
#define USBPHY_DEBUG_CLR_ENHSTPULLDOWN(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_ENHSTPULLDOWN_SHIFT))&USBPHY_DEBUG_CLR_ENHSTPULLDOWN_MASK)
#define USBPHY_DEBUG_CLR_TX2RXCOUNT_MASK         0xF00u
#define USBPHY_DEBUG_CLR_TX2RXCOUNT_SHIFT        8
#define USBPHY_DEBUG_CLR_TX2RXCOUNT(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_TX2RXCOUNT_SHIFT))&USBPHY_DEBUG_CLR_TX2RXCOUNT_MASK)
#define USBPHY_DEBUG_CLR_ENTX2RXCOUNT_MASK       0x1000u
#define USBPHY_DEBUG_CLR_ENTX2RXCOUNT_SHIFT      12
#define USBPHY_DEBUG_CLR_SQUELCHRESETCOUNT_MASK  0x1F0000u
#define USBPHY_DEBUG_CLR_SQUELCHRESETCOUNT_SHIFT 16
#define USBPHY_DEBUG_CLR_SQUELCHRESETCOUNT(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_SQUELCHRESETCOUNT_SHIFT))&USBPHY_DEBUG_CLR_SQUELCHRESETCOUNT_MASK)
#define USBPHY_DEBUG_CLR_ENSQUELCHRESET_MASK     0x1000000u
#define USBPHY_DEBUG_CLR_ENSQUELCHRESET_SHIFT    24
#define USBPHY_DEBUG_CLR_SQUELCHRESETLENGTH_MASK 0x1E000000u
#define USBPHY_DEBUG_CLR_SQUELCHRESETLENGTH_SHIFT 25
#define USBPHY_DEBUG_CLR_SQUELCHRESETLENGTH(x)   (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_CLR_SQUELCHRESETLENGTH_SHIFT))&USBPHY_DEBUG_CLR_SQUELCHRESETLENGTH_MASK)
#define USBPHY_DEBUG_CLR_HOST_RESUME_DEBUG_MASK  0x20000000u
#define USBPHY_DEBUG_CLR_HOST_RESUME_DEBUG_SHIFT 29
#define USBPHY_DEBUG_CLR_CLKGATE_MASK            0x40000000u
#define USBPHY_DEBUG_CLR_CLKGATE_SHIFT           30
/* DEBUG_TOG Bit Fields */
#define USBPHY_DEBUG_TOG_OTGIDPIOLOCK_MASK       0x1u
#define USBPHY_DEBUG_TOG_OTGIDPIOLOCK_SHIFT      0
#define USBPHY_DEBUG_TOG_DEBUG_INTERFACE_HOLD_MASK 0x2u
#define USBPHY_DEBUG_TOG_DEBUG_INTERFACE_HOLD_SHIFT 1
#define USBPHY_DEBUG_TOG_HSTPULLDOWN_MASK        0xCu
#define USBPHY_DEBUG_TOG_HSTPULLDOWN_SHIFT       2
#define USBPHY_DEBUG_TOG_HSTPULLDOWN(x)          (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_HSTPULLDOWN_SHIFT))&USBPHY_DEBUG_TOG_HSTPULLDOWN_MASK)
#define USBPHY_DEBUG_TOG_ENHSTPULLDOWN_MASK      0x30u
#define USBPHY_DEBUG_TOG_ENHSTPULLDOWN_SHIFT     4
#define USBPHY_DEBUG_TOG_ENHSTPULLDOWN(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_ENHSTPULLDOWN_SHIFT))&USBPHY_DEBUG_TOG_ENHSTPULLDOWN_MASK)
#define USBPHY_DEBUG_TOG_TX2RXCOUNT_MASK         0xF00u
#define USBPHY_DEBUG_TOG_TX2RXCOUNT_SHIFT        8
#define USBPHY_DEBUG_TOG_TX2RXCOUNT(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_TX2RXCOUNT_SHIFT))&USBPHY_DEBUG_TOG_TX2RXCOUNT_MASK)
#define USBPHY_DEBUG_TOG_ENTX2RXCOUNT_MASK       0x1000u
#define USBPHY_DEBUG_TOG_ENTX2RXCOUNT_SHIFT      12
#define USBPHY_DEBUG_TOG_SQUELCHRESETCOUNT_MASK  0x1F0000u
#define USBPHY_DEBUG_TOG_SQUELCHRESETCOUNT_SHIFT 16
#define USBPHY_DEBUG_TOG_SQUELCHRESETCOUNT(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_SQUELCHRESETCOUNT_SHIFT))&USBPHY_DEBUG_TOG_SQUELCHRESETCOUNT_MASK)
#define USBPHY_DEBUG_TOG_ENSQUELCHRESET_MASK     0x1000000u
#define USBPHY_DEBUG_TOG_ENSQUELCHRESET_SHIFT    24
#define USBPHY_DEBUG_TOG_SQUELCHRESETLENGTH_MASK 0x1E000000u
#define USBPHY_DEBUG_TOG_SQUELCHRESETLENGTH_SHIFT 25
#define USBPHY_DEBUG_TOG_SQUELCHRESETLENGTH(x)   (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG_TOG_SQUELCHRESETLENGTH_SHIFT))&USBPHY_DEBUG_TOG_SQUELCHRESETLENGTH_MASK)
#define USBPHY_DEBUG_TOG_HOST_RESUME_DEBUG_MASK  0x20000000u
#define USBPHY_DEBUG_TOG_HOST_RESUME_DEBUG_SHIFT 29
#define USBPHY_DEBUG_TOG_CLKGATE_MASK            0x40000000u
#define USBPHY_DEBUG_TOG_CLKGATE_SHIFT           30
/* DEBUG0_STATUS Bit Fields */
#define USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_MASK 0xFFFFu
#define USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_SHIFT 0
#define USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_SHIFT))&USBPHY_DEBUG0_STATUS_LOOP_BACK_FAIL_COUNT_MASK)
#define USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_MASK 0x3FF0000u
#define USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_SHIFT 16
#define USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_SHIFT))&USBPHY_DEBUG0_STATUS_UTMI_RXERROR_FAIL_COUNT_MASK)
#define USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_MASK  0xFC000000u
#define USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_SHIFT 26
#define USBPHY_DEBUG0_STATUS_SQUELCH_COUNT(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_SHIFT))&USBPHY_DEBUG0_STATUS_SQUELCH_COUNT_MASK)
/* DEBUG1 Bit Fields */
#define USBPHY_DEBUG1_ENTAILADJVD_MASK           0x6000u
#define USBPHY_DEBUG1_ENTAILADJVD_SHIFT          13
#define USBPHY_DEBUG1_ENTAILADJVD(x)             (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG1_ENTAILADJVD_SHIFT))&USBPHY_DEBUG1_ENTAILADJVD_MASK)
/* DEBUG1_SET Bit Fields */
#define USBPHY_DEBUG1_SET_ENTAILADJVD_MASK       0x6000u
#define USBPHY_DEBUG1_SET_ENTAILADJVD_SHIFT      13
#define USBPHY_DEBUG1_SET_ENTAILADJVD(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG1_SET_ENTAILADJVD_SHIFT))&USBPHY_DEBUG1_SET_ENTAILADJVD_MASK)
/* DEBUG1_CLR Bit Fields */
#define USBPHY_DEBUG1_CLR_ENTAILADJVD_MASK       0x6000u
#define USBPHY_DEBUG1_CLR_ENTAILADJVD_SHIFT      13
#define USBPHY_DEBUG1_CLR_ENTAILADJVD(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG1_CLR_ENTAILADJVD_SHIFT))&USBPHY_DEBUG1_CLR_ENTAILADJVD_MASK)
/* DEBUG1_TOG Bit Fields */
#define USBPHY_DEBUG1_TOG_ENTAILADJVD_MASK       0x6000u
#define USBPHY_DEBUG1_TOG_ENTAILADJVD_SHIFT      13
#define USBPHY_DEBUG1_TOG_ENTAILADJVD(x)         (((uint32_t)(((uint32_t)(x))<<USBPHY_DEBUG1_TOG_ENTAILADJVD_SHIFT))&USBPHY_DEBUG1_TOG_ENTAILADJVD_MASK)
/* VERSION Bit Fields */
#define USBPHY_VERSION_STEP_MASK                 0xFFFFu
#define USBPHY_VERSION_STEP_SHIFT                0
#define USBPHY_VERSION_STEP(x)                   (((uint32_t)(((uint32_t)(x))<<USBPHY_VERSION_STEP_SHIFT))&USBPHY_VERSION_STEP_MASK)
#define USBPHY_VERSION_MINOR_MASK                0xFF0000u
#define USBPHY_VERSION_MINOR_SHIFT               16
#define USBPHY_VERSION_MINOR(x)                  (((uint32_t)(((uint32_t)(x))<<USBPHY_VERSION_MINOR_SHIFT))&USBPHY_VERSION_MINOR_MASK)
#define USBPHY_VERSION_MAJOR_MASK                0xFF000000u
#define USBPHY_VERSION_MAJOR_SHIFT               24
#define USBPHY_VERSION_MAJOR(x)                  (((uint32_t)(((uint32_t)(x))<<USBPHY_VERSION_MAJOR_SHIFT))&USBPHY_VERSION_MAJOR_MASK)
/* PLL_SIC Bit Fields */
#define USBPHY_PLL_SIC_PLL_DIV_SEL_MASK          0x3u
#define USBPHY_PLL_SIC_PLL_DIV_SEL_SHIFT         0
#define USBPHY_PLL_SIC_PLL_DIV_SEL(x)            (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_PLL_DIV_SEL_SHIFT))&USBPHY_PLL_SIC_PLL_DIV_SEL_MASK)
#define USBPHY_PLL_SIC_PLL_EN_USB_CLKS_MASK      0x40u
#define USBPHY_PLL_SIC_PLL_EN_USB_CLKS_SHIFT     6
#define USBPHY_PLL_SIC_PLL_HOLD_RING_OFF_MASK    0x800u
#define USBPHY_PLL_SIC_PLL_HOLD_RING_OFF_SHIFT   11
#define USBPHY_PLL_SIC_PLL_POWER_MASK            0x1000u
#define USBPHY_PLL_SIC_PLL_POWER_SHIFT           12
#define USBPHY_PLL_SIC_PLL_ENABLE_MASK           0x2000u
#define USBPHY_PLL_SIC_PLL_ENABLE_SHIFT          13
#define USBPHY_PLL_SIC_PLL_BYPASS_MASK           0x10000u
#define USBPHY_PLL_SIC_PLL_BYPASS_SHIFT          16
#define USBPHY_PLL_SIC_PLL_LOCK_MASK             0x80000000u
#define USBPHY_PLL_SIC_PLL_LOCK_SHIFT            31
/* PLL_SIC_SET Bit Fields */
#define USBPHY_PLL_SIC_SET_PLL_DIV_SEL_MASK      0x3u
#define USBPHY_PLL_SIC_SET_PLL_DIV_SEL_SHIFT     0
#define USBPHY_PLL_SIC_SET_PLL_DIV_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_SET_PLL_DIV_SEL_SHIFT))&USBPHY_PLL_SIC_SET_PLL_DIV_SEL_MASK)
#define USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS_MASK  0x40u
#define USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS_SHIFT 6
#define USBPHY_PLL_SIC_SET_PLL_HOLD_RING_OFF_MASK 0x800u
#define USBPHY_PLL_SIC_SET_PLL_HOLD_RING_OFF_SHIFT 11
#define USBPHY_PLL_SIC_SET_PLL_POWER_MASK        0x1000u
#define USBPHY_PLL_SIC_SET_PLL_POWER_SHIFT       12
#define USBPHY_PLL_SIC_SET_PLL_ENABLE_MASK       0x2000u
#define USBPHY_PLL_SIC_SET_PLL_ENABLE_SHIFT      13
#define USBPHY_PLL_SIC_SET_PLL_BYPASS_MASK       0x10000u
#define USBPHY_PLL_SIC_SET_PLL_BYPASS_SHIFT      16
#define USBPHY_PLL_SIC_SET_PLL_LOCK_MASK         0x80000000u
#define USBPHY_PLL_SIC_SET_PLL_LOCK_SHIFT        31
/* PLL_SIC_CLR Bit Fields */
#define USBPHY_PLL_SIC_CLR_PLL_DIV_SEL_MASK      0x3u
#define USBPHY_PLL_SIC_CLR_PLL_DIV_SEL_SHIFT     0
#define USBPHY_PLL_SIC_CLR_PLL_DIV_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_CLR_PLL_DIV_SEL_SHIFT))&USBPHY_PLL_SIC_CLR_PLL_DIV_SEL_MASK)
#define USBPHY_PLL_SIC_CLR_PLL_EN_USB_CLKS_MASK  0x40u
#define USBPHY_PLL_SIC_CLR_PLL_EN_USB_CLKS_SHIFT 6
#define USBPHY_PLL_SIC_CLR_PLL_HOLD_RING_OFF_MASK 0x800u
#define USBPHY_PLL_SIC_CLR_PLL_HOLD_RING_OFF_SHIFT 11
#define USBPHY_PLL_SIC_CLR_PLL_POWER_MASK        0x1000u
#define USBPHY_PLL_SIC_CLR_PLL_POWER_SHIFT       12
#define USBPHY_PLL_SIC_CLR_PLL_ENABLE_MASK       0x2000u
#define USBPHY_PLL_SIC_CLR_PLL_ENABLE_SHIFT      13
#define USBPHY_PLL_SIC_CLR_PLL_BYPASS_MASK       0x10000u
#define USBPHY_PLL_SIC_CLR_PLL_BYPASS_SHIFT      16
#define USBPHY_PLL_SIC_CLR_PLL_LOCK_MASK         0x80000000u
#define USBPHY_PLL_SIC_CLR_PLL_LOCK_SHIFT        31
/* PLL_SIC_TOG Bit Fields */
#define USBPHY_PLL_SIC_TOG_PLL_DIV_SEL_MASK      0x3u
#define USBPHY_PLL_SIC_TOG_PLL_DIV_SEL_SHIFT     0
#define USBPHY_PLL_SIC_TOG_PLL_DIV_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_PLL_SIC_TOG_PLL_DIV_SEL_SHIFT))&USBPHY_PLL_SIC_TOG_PLL_DIV_SEL_MASK)
#define USBPHY_PLL_SIC_TOG_PLL_EN_USB_CLKS_MASK  0x40u
#define USBPHY_PLL_SIC_TOG_PLL_EN_USB_CLKS_SHIFT 6
#define USBPHY_PLL_SIC_TOG_PLL_HOLD_RING_OFF_MASK 0x800u
#define USBPHY_PLL_SIC_TOG_PLL_HOLD_RING_OFF_SHIFT 11
#define USBPHY_PLL_SIC_TOG_PLL_POWER_MASK        0x1000u
#define USBPHY_PLL_SIC_TOG_PLL_POWER_SHIFT       12
#define USBPHY_PLL_SIC_TOG_PLL_ENABLE_MASK       0x2000u
#define USBPHY_PLL_SIC_TOG_PLL_ENABLE_SHIFT      13
#define USBPHY_PLL_SIC_TOG_PLL_BYPASS_MASK       0x10000u
#define USBPHY_PLL_SIC_TOG_PLL_BYPASS_SHIFT      16
#define USBPHY_PLL_SIC_TOG_PLL_LOCK_MASK         0x80000000u
#define USBPHY_PLL_SIC_TOG_PLL_LOCK_SHIFT        31
/* USB1_VBUS_DETECT Bit Fields */
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH_MASK 0x7u
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH_SHIFT 0
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH_SHIFT))&USBPHY_USB1_VBUS_DETECT_VBUSVALID_THRESH_MASK)
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID_MASK 0x40000u
#define USBPHY_USB1_VBUS_DETECT_VBUSVALID_TO_SESSVALID_SHIFT 18
#define USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_MASK  0x700000u
#define USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_SHIFT 20
#define USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_SHIFT))&USBPHY_USB1_VBUS_DETECT_PWRUP_CMPS_MASK)
#define USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS_MASK 0x4000000u
#define USBPHY_USB1_VBUS_DETECT_DISCHARGE_VBUS_SHIFT 26
#define USBPHY_USB1_VBUS_DETECT_CHARGE_VBUS_MASK 0x8000000u
#define USBPHY_USB1_VBUS_DETECT_CHARGE_VBUS_SHIFT 27
/* USB1_VBUS_DETECT_SET Bit Fields */
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_THRESH_MASK 0x7u
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_THRESH_SHIFT 0
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_THRESH(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_THRESH_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_THRESH_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_TO_SESSVALID_MASK 0x40000u
#define USBPHY_USB1_VBUS_DETECT_SET_VBUSVALID_TO_SESSVALID_SHIFT 18
#define USBPHY_USB1_VBUS_DETECT_SET_PWRUP_CMPS_MASK 0x700000u
#define USBPHY_USB1_VBUS_DETECT_SET_PWRUP_CMPS_SHIFT 20
#define USBPHY_USB1_VBUS_DETECT_SET_PWRUP_CMPS(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_SET_PWRUP_CMPS_SHIFT))&USBPHY_USB1_VBUS_DETECT_SET_PWRUP_CMPS_MASK)
#define USBPHY_USB1_VBUS_DETECT_SET_DISCHARGE_VBUS_MASK 0x4000000u
#define USBPHY_USB1_VBUS_DETECT_SET_DISCHARGE_VBUS_SHIFT 26
#define USBPHY_USB1_VBUS_DETECT_SET_CHARGE_VBUS_MASK 0x8000000u
#define USBPHY_USB1_VBUS_DETECT_SET_CHARGE_VBUS_SHIFT 27
/* USB1_VBUS_DETECT_CLR Bit Fields */
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_THRESH_MASK 0x7u
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_THRESH_SHIFT 0
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_THRESH(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_THRESH_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_THRESH_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_TO_SESSVALID_MASK 0x40000u
#define USBPHY_USB1_VBUS_DETECT_CLR_VBUSVALID_TO_SESSVALID_SHIFT 18
#define USBPHY_USB1_VBUS_DETECT_CLR_PWRUP_CMPS_MASK 0x700000u
#define USBPHY_USB1_VBUS_DETECT_CLR_PWRUP_CMPS_SHIFT 20
#define USBPHY_USB1_VBUS_DETECT_CLR_PWRUP_CMPS(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_CLR_PWRUP_CMPS_SHIFT))&USBPHY_USB1_VBUS_DETECT_CLR_PWRUP_CMPS_MASK)
#define USBPHY_USB1_VBUS_DETECT_CLR_DISCHARGE_VBUS_MASK 0x4000000u
#define USBPHY_USB1_VBUS_DETECT_CLR_DISCHARGE_VBUS_SHIFT 26
#define USBPHY_USB1_VBUS_DETECT_CLR_CHARGE_VBUS_MASK 0x8000000u
#define USBPHY_USB1_VBUS_DETECT_CLR_CHARGE_VBUS_SHIFT 27
/* USB1_VBUS_DETECT_TOG Bit Fields */
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_THRESH_MASK 0x7u
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_THRESH_SHIFT 0
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_THRESH(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_THRESH_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_THRESH_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_TO_SESSVALID_MASK 0x40000u
#define USBPHY_USB1_VBUS_DETECT_TOG_VBUSVALID_TO_SESSVALID_SHIFT 18
#define USBPHY_USB1_VBUS_DETECT_TOG_PWRUP_CMPS_MASK 0x700000u
#define USBPHY_USB1_VBUS_DETECT_TOG_PWRUP_CMPS_SHIFT 20
#define USBPHY_USB1_VBUS_DETECT_TOG_PWRUP_CMPS(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_VBUS_DETECT_TOG_PWRUP_CMPS_SHIFT))&USBPHY_USB1_VBUS_DETECT_TOG_PWRUP_CMPS_MASK)
#define USBPHY_USB1_VBUS_DETECT_TOG_DISCHARGE_VBUS_MASK 0x4000000u
#define USBPHY_USB1_VBUS_DETECT_TOG_DISCHARGE_VBUS_SHIFT 26
#define USBPHY_USB1_VBUS_DETECT_TOG_CHARGE_VBUS_MASK 0x8000000u
#define USBPHY_USB1_VBUS_DETECT_TOG_CHARGE_VBUS_SHIFT 27
/* USB1_VBUS_DET_STAT Bit Fields */
#define USBPHY_USB1_VBUS_DET_STAT_SESSEND_MASK   0x1u
#define USBPHY_USB1_VBUS_DET_STAT_SESSEND_SHIFT  0
#define USBPHY_USB1_VBUS_DET_STAT_BVALID_MASK    0x2u
#define USBPHY_USB1_VBUS_DET_STAT_BVALID_SHIFT   1
#define USBPHY_USB1_VBUS_DET_STAT_AVALID_MASK    0x4u
#define USBPHY_USB1_VBUS_DET_STAT_AVALID_SHIFT   2
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_MASK 0x8u
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_SHIFT 3
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V_MASK 0x10u
#define USBPHY_USB1_VBUS_DET_STAT_VBUS_VALID_3V_SHIFT 4
/* ANACTRL Bit Fields */
#define USBPHY_ANACTRL_TESTCLK_SEL_MASK          0x1u
#define USBPHY_ANACTRL_TESTCLK_SEL_SHIFT         0
#define USBPHY_ANACTRL_PFD_CLKGATE_MASK          0x2u
#define USBPHY_ANACTRL_PFD_CLKGATE_SHIFT         1
#define USBPHY_ANACTRL_PFD_CLK_SEL_MASK          0xCu
#define USBPHY_ANACTRL_PFD_CLK_SEL_SHIFT         2
#define USBPHY_ANACTRL_PFD_CLK_SEL(x)            (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_PFD_CLK_SEL_SHIFT))&USBPHY_ANACTRL_PFD_CLK_SEL_MASK)
#define USBPHY_ANACTRL_PFD_FRAC_MASK             0x3F0u
#define USBPHY_ANACTRL_PFD_FRAC_SHIFT            4
#define USBPHY_ANACTRL_PFD_FRAC(x)               (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_PFD_FRAC_SHIFT))&USBPHY_ANACTRL_PFD_FRAC_MASK)
#define USBPHY_ANACTRL_DEV_PULLDOWN_MASK         0x400u
#define USBPHY_ANACTRL_DEV_PULLDOWN_SHIFT        10
#define USBPHY_ANACTRL_EMPH_PULSE_CTRL_MASK      0x1800u
#define USBPHY_ANACTRL_EMPH_PULSE_CTRL_SHIFT     11
#define USBPHY_ANACTRL_EMPH_PULSE_CTRL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_EMPH_PULSE_CTRL_SHIFT))&USBPHY_ANACTRL_EMPH_PULSE_CTRL_MASK)
#define USBPHY_ANACTRL_EMPH_EN_MASK              0x2000u
#define USBPHY_ANACTRL_EMPH_EN_SHIFT             13
#define USBPHY_ANACTRL_EMPH_CUR_CTRL_MASK        0xC000u
#define USBPHY_ANACTRL_EMPH_CUR_CTRL_SHIFT       14
#define USBPHY_ANACTRL_EMPH_CUR_CTRL(x)          (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_EMPH_CUR_CTRL_SHIFT))&USBPHY_ANACTRL_EMPH_CUR_CTRL_MASK)
#define USBPHY_ANACTRL_PFD_STABLE_MASK           0x80000000u
#define USBPHY_ANACTRL_PFD_STABLE_SHIFT          31
/* ANACTRL_SET Bit Fields */
#define USBPHY_ANACTRL_SET_TESTCLK_SEL_MASK      0x1u
#define USBPHY_ANACTRL_SET_TESTCLK_SEL_SHIFT     0
#define USBPHY_ANACTRL_SET_PFD_CLKGATE_MASK      0x2u
#define USBPHY_ANACTRL_SET_PFD_CLKGATE_SHIFT     1
#define USBPHY_ANACTRL_SET_PFD_CLK_SEL_MASK      0xCu
#define USBPHY_ANACTRL_SET_PFD_CLK_SEL_SHIFT     2
#define USBPHY_ANACTRL_SET_PFD_CLK_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_PFD_CLK_SEL_SHIFT))&USBPHY_ANACTRL_SET_PFD_CLK_SEL_MASK)
#define USBPHY_ANACTRL_SET_PFD_FRAC_MASK         0x3F0u
#define USBPHY_ANACTRL_SET_PFD_FRAC_SHIFT        4
#define USBPHY_ANACTRL_SET_PFD_FRAC(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_PFD_FRAC_SHIFT))&USBPHY_ANACTRL_SET_PFD_FRAC_MASK)
#define USBPHY_ANACTRL_SET_DEV_PULLDOWN_MASK     0x400u
#define USBPHY_ANACTRL_SET_DEV_PULLDOWN_SHIFT    10
#define USBPHY_ANACTRL_SET_EMPH_PULSE_CTRL_MASK  0x1800u
#define USBPHY_ANACTRL_SET_EMPH_PULSE_CTRL_SHIFT 11
#define USBPHY_ANACTRL_SET_EMPH_PULSE_CTRL(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_EMPH_PULSE_CTRL_SHIFT))&USBPHY_ANACTRL_SET_EMPH_PULSE_CTRL_MASK)
#define USBPHY_ANACTRL_SET_EMPH_EN_MASK          0x2000u
#define USBPHY_ANACTRL_SET_EMPH_EN_SHIFT         13
#define USBPHY_ANACTRL_SET_EMPH_CUR_CTRL_MASK    0xC000u
#define USBPHY_ANACTRL_SET_EMPH_CUR_CTRL_SHIFT   14
#define USBPHY_ANACTRL_SET_EMPH_CUR_CTRL(x)      (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_SET_EMPH_CUR_CTRL_SHIFT))&USBPHY_ANACTRL_SET_EMPH_CUR_CTRL_MASK)
#define USBPHY_ANACTRL_SET_PFD_STABLE_MASK       0x80000000u
#define USBPHY_ANACTRL_SET_PFD_STABLE_SHIFT      31
/* ANACTRL_CLR Bit Fields */
#define USBPHY_ANACTRL_CLR_TESTCLK_SEL_MASK      0x1u
#define USBPHY_ANACTRL_CLR_TESTCLK_SEL_SHIFT     0
#define USBPHY_ANACTRL_CLR_PFD_CLKGATE_MASK      0x2u
#define USBPHY_ANACTRL_CLR_PFD_CLKGATE_SHIFT     1
#define USBPHY_ANACTRL_CLR_PFD_CLK_SEL_MASK      0xCu
#define USBPHY_ANACTRL_CLR_PFD_CLK_SEL_SHIFT     2
#define USBPHY_ANACTRL_CLR_PFD_CLK_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_PFD_CLK_SEL_SHIFT))&USBPHY_ANACTRL_CLR_PFD_CLK_SEL_MASK)
#define USBPHY_ANACTRL_CLR_PFD_FRAC_MASK         0x3F0u
#define USBPHY_ANACTRL_CLR_PFD_FRAC_SHIFT        4
#define USBPHY_ANACTRL_CLR_PFD_FRAC(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_PFD_FRAC_SHIFT))&USBPHY_ANACTRL_CLR_PFD_FRAC_MASK)
#define USBPHY_ANACTRL_CLR_DEV_PULLDOWN_MASK     0x400u
#define USBPHY_ANACTRL_CLR_DEV_PULLDOWN_SHIFT    10
#define USBPHY_ANACTRL_CLR_EMPH_PULSE_CTRL_MASK  0x1800u
#define USBPHY_ANACTRL_CLR_EMPH_PULSE_CTRL_SHIFT 11
#define USBPHY_ANACTRL_CLR_EMPH_PULSE_CTRL(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_EMPH_PULSE_CTRL_SHIFT))&USBPHY_ANACTRL_CLR_EMPH_PULSE_CTRL_MASK)
#define USBPHY_ANACTRL_CLR_EMPH_EN_MASK          0x2000u
#define USBPHY_ANACTRL_CLR_EMPH_EN_SHIFT         13
#define USBPHY_ANACTRL_CLR_EMPH_CUR_CTRL_MASK    0xC000u
#define USBPHY_ANACTRL_CLR_EMPH_CUR_CTRL_SHIFT   14
#define USBPHY_ANACTRL_CLR_EMPH_CUR_CTRL(x)      (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_CLR_EMPH_CUR_CTRL_SHIFT))&USBPHY_ANACTRL_CLR_EMPH_CUR_CTRL_MASK)
#define USBPHY_ANACTRL_CLR_PFD_STABLE_MASK       0x80000000u
#define USBPHY_ANACTRL_CLR_PFD_STABLE_SHIFT      31
/* ANACTRL_TOG Bit Fields */
#define USBPHY_ANACTRL_TOG_TESTCLK_SEL_MASK      0x1u
#define USBPHY_ANACTRL_TOG_TESTCLK_SEL_SHIFT     0
#define USBPHY_ANACTRL_TOG_PFD_CLKGATE_MASK      0x2u
#define USBPHY_ANACTRL_TOG_PFD_CLKGATE_SHIFT     1
#define USBPHY_ANACTRL_TOG_PFD_CLK_SEL_MASK      0xCu
#define USBPHY_ANACTRL_TOG_PFD_CLK_SEL_SHIFT     2
#define USBPHY_ANACTRL_TOG_PFD_CLK_SEL(x)        (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_PFD_CLK_SEL_SHIFT))&USBPHY_ANACTRL_TOG_PFD_CLK_SEL_MASK)
#define USBPHY_ANACTRL_TOG_PFD_FRAC_MASK         0x3F0u
#define USBPHY_ANACTRL_TOG_PFD_FRAC_SHIFT        4
#define USBPHY_ANACTRL_TOG_PFD_FRAC(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_PFD_FRAC_SHIFT))&USBPHY_ANACTRL_TOG_PFD_FRAC_MASK)
#define USBPHY_ANACTRL_TOG_DEV_PULLDOWN_MASK     0x400u
#define USBPHY_ANACTRL_TOG_DEV_PULLDOWN_SHIFT    10
#define USBPHY_ANACTRL_TOG_EMPH_PULSE_CTRL_MASK  0x1800u
#define USBPHY_ANACTRL_TOG_EMPH_PULSE_CTRL_SHIFT 11
#define USBPHY_ANACTRL_TOG_EMPH_PULSE_CTRL(x)    (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_EMPH_PULSE_CTRL_SHIFT))&USBPHY_ANACTRL_TOG_EMPH_PULSE_CTRL_MASK)
#define USBPHY_ANACTRL_TOG_EMPH_EN_MASK          0x2000u
#define USBPHY_ANACTRL_TOG_EMPH_EN_SHIFT         13
#define USBPHY_ANACTRL_TOG_EMPH_CUR_CTRL_MASK    0xC000u
#define USBPHY_ANACTRL_TOG_EMPH_CUR_CTRL_SHIFT   14
#define USBPHY_ANACTRL_TOG_EMPH_CUR_CTRL(x)      (((uint32_t)(((uint32_t)(x))<<USBPHY_ANACTRL_TOG_EMPH_CUR_CTRL_SHIFT))&USBPHY_ANACTRL_TOG_EMPH_CUR_CTRL_MASK)
#define USBPHY_ANACTRL_TOG_PFD_STABLE_MASK       0x80000000u
#define USBPHY_ANACTRL_TOG_PFD_STABLE_SHIFT      31
/* USB1_LOOPBACK Bit Fields */
#define USBPHY_USB1_LOOPBACK_UTMI_TESTSTART_MASK 0x1u
#define USBPHY_USB1_LOOPBACK_UTMI_TESTSTART_SHIFT 0
#define USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0_MASK  0x2u
#define USBPHY_USB1_LOOPBACK_UTMI_DIG_TST0_SHIFT 1
#define USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1_MASK  0x4u
#define USBPHY_USB1_LOOPBACK_UTMI_DIG_TST1_SHIFT 2
#define USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE_MASK 0x8u
#define USBPHY_USB1_LOOPBACK_TSTI_TX_HS_MODE_SHIFT 3
#define USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE_MASK 0x10u
#define USBPHY_USB1_LOOPBACK_TSTI_TX_LS_MODE_SHIFT 4
#define USBPHY_USB1_LOOPBACK_TSTI_TX_EN_MASK     0x20u
#define USBPHY_USB1_LOOPBACK_TSTI_TX_EN_SHIFT    5
#define USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ_MASK    0x40u
#define USBPHY_USB1_LOOPBACK_TSTI_TX_HIZ_SHIFT   6
#define USBPHY_USB1_LOOPBACK_UTMO_DIG_TST0_MASK  0x80u
#define USBPHY_USB1_LOOPBACK_UTMO_DIG_TST0_SHIFT 7
#define USBPHY_USB1_LOOPBACK_UTMO_DIG_TST1_MASK  0x100u
