kcuzner/teensy-oscilloscope/scope-teensy/include/MK65F18WS.h
#define USBPHY_USB1_LOOPBACK_UTMO_DIG_TST1_SHIFT 8
#define USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN_MASK 0x8000u
#define USBPHY_USB1_LOOPBACK_TSTI_HSFS_MODE_EN_SHIFT 15
#define USBPHY_USB1_LOOPBACK_TSTPKT_MASK         0xFF0000u
#define USBPHY_USB1_LOOPBACK_TSTPKT_SHIFT        16
#define USBPHY_USB1_LOOPBACK_TSTPKT(x)           (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TSTPKT_SHIFT))&USBPHY_USB1_LOOPBACK_TSTPKT_MASK)
/* USB1_LOOPBACK_SET Bit Fields */
#define USBPHY_USB1_LOOPBACK_SET_UTMI_TESTSTART_MASK 0x1u
#define USBPHY_USB1_LOOPBACK_SET_UTMI_TESTSTART_SHIFT 0
#define USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST0_MASK 0x2u
#define USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST0_SHIFT 1
#define USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST1_MASK 0x4u
#define USBPHY_USB1_LOOPBACK_SET_UTMI_DIG_TST1_SHIFT 2
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HS_MODE_MASK 0x8u
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HS_MODE_SHIFT 3
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_LS_MODE_MASK 0x10u
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_LS_MODE_SHIFT 4
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_EN_MASK 0x20u
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_EN_SHIFT 5
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HIZ_MASK 0x40u
#define USBPHY_USB1_LOOPBACK_SET_TSTI_TX_HIZ_SHIFT 6
#define USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST0_MASK 0x80u
#define USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST0_SHIFT 7
#define USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST1_MASK 0x100u
#define USBPHY_USB1_LOOPBACK_SET_UTMO_DIG_TST1_SHIFT 8
#define USBPHY_USB1_LOOPBACK_SET_TSTI_HSFS_MODE_EN_MASK 0x8000u
#define USBPHY_USB1_LOOPBACK_SET_TSTI_HSFS_MODE_EN_SHIFT 15
#define USBPHY_USB1_LOOPBACK_SET_TSTPKT_MASK     0xFF0000u
#define USBPHY_USB1_LOOPBACK_SET_TSTPKT_SHIFT    16
#define USBPHY_USB1_LOOPBACK_SET_TSTPKT(x)       (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_SET_TSTPKT_SHIFT))&USBPHY_USB1_LOOPBACK_SET_TSTPKT_MASK)
/* USB1_LOOPBACK_CLR Bit Fields */
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_TESTSTART_MASK 0x1u
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_TESTSTART_SHIFT 0
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST0_MASK 0x2u
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST0_SHIFT 1
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST1_MASK 0x4u
#define USBPHY_USB1_LOOPBACK_CLR_UTMI_DIG_TST1_SHIFT 2
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HS_MODE_MASK 0x8u
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HS_MODE_SHIFT 3
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_LS_MODE_MASK 0x10u
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_LS_MODE_SHIFT 4
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_EN_MASK 0x20u
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_EN_SHIFT 5
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HIZ_MASK 0x40u
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_TX_HIZ_SHIFT 6
#define USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST0_MASK 0x80u
#define USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST0_SHIFT 7
#define USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST1_MASK 0x100u
#define USBPHY_USB1_LOOPBACK_CLR_UTMO_DIG_TST1_SHIFT 8
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_HSFS_MODE_EN_MASK 0x8000u
#define USBPHY_USB1_LOOPBACK_CLR_TSTI_HSFS_MODE_EN_SHIFT 15
#define USBPHY_USB1_LOOPBACK_CLR_TSTPKT_MASK     0xFF0000u
#define USBPHY_USB1_LOOPBACK_CLR_TSTPKT_SHIFT    16
#define USBPHY_USB1_LOOPBACK_CLR_TSTPKT(x)       (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_CLR_TSTPKT_SHIFT))&USBPHY_USB1_LOOPBACK_CLR_TSTPKT_MASK)
/* USB1_LOOPBACK_TOG Bit Fields */
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_TESTSTART_MASK 0x1u
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_TESTSTART_SHIFT 0
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST0_MASK 0x2u
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST0_SHIFT 1
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST1_MASK 0x4u
#define USBPHY_USB1_LOOPBACK_TOG_UTMI_DIG_TST1_SHIFT 2
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HS_MODE_MASK 0x8u
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HS_MODE_SHIFT 3
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_LS_MODE_MASK 0x10u
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_LS_MODE_SHIFT 4
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_EN_MASK 0x20u
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_EN_SHIFT 5
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HIZ_MASK 0x40u
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_TX_HIZ_SHIFT 6
#define USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST0_MASK 0x80u
#define USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST0_SHIFT 7
#define USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST1_MASK 0x100u
#define USBPHY_USB1_LOOPBACK_TOG_UTMO_DIG_TST1_SHIFT 8
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_HSFS_MODE_EN_MASK 0x8000u
#define USBPHY_USB1_LOOPBACK_TOG_TSTI_HSFS_MODE_EN_SHIFT 15
#define USBPHY_USB1_LOOPBACK_TOG_TSTPKT_MASK     0xFF0000u
#define USBPHY_USB1_LOOPBACK_TOG_TSTPKT_SHIFT    16
#define USBPHY_USB1_LOOPBACK_TOG_TSTPKT(x)       (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_TOG_TSTPKT_SHIFT))&USBPHY_USB1_LOOPBACK_TOG_TSTPKT_MASK)
/* USB1_LOOPBACK_HSFSCNT Bit Fields */
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER_MASK 0xFFFFu
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER_SHIFT 0
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_HS_NUMBER_MASK)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER_MASK 0xFFFF0000u
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER_SHIFT 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_TSTI_FS_NUMBER_MASK)
/* USB1_LOOPBACK_HSFSCNT_SET Bit Fields */
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_HS_NUMBER_MASK 0xFFFFu
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_HS_NUMBER_SHIFT 0
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_HS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_HS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_HS_NUMBER_MASK)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_FS_NUMBER_MASK 0xFFFF0000u
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_FS_NUMBER_SHIFT 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_FS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_FS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_SET_TSTI_FS_NUMBER_MASK)
/* USB1_LOOPBACK_HSFSCNT_CLR Bit Fields */
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_HS_NUMBER_MASK 0xFFFFu
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_HS_NUMBER_SHIFT 0
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_HS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_HS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_HS_NUMBER_MASK)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_FS_NUMBER_MASK 0xFFFF0000u
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_FS_NUMBER_SHIFT 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_FS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_FS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_TSTI_FS_NUMBER_MASK)
/* USB1_LOOPBACK_HSFSCNT_TOG Bit Fields */
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_HS_NUMBER_MASK 0xFFFFu
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_HS_NUMBER_SHIFT 0
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_HS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_HS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_HS_NUMBER_MASK)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_FS_NUMBER_MASK 0xFFFF0000u
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_FS_NUMBER_SHIFT 16
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_FS_NUMBER(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_FS_NUMBER_SHIFT))&USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_TSTI_FS_NUMBER_MASK)
/* TRIM_OVERRIDE_EN Bit Fields */
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE_MASK 0x1u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_DIV_SEL_OVERRIDE_SHIFT 0
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_MASK 0x2u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_SHIFT 1
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE_MASK 0x4u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_D_CAL_OVERRIDE_SHIFT 2
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE_MASK 0x8u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DP_OVERRIDE_SHIFT 3
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE_MASK 0x10u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_TX_CAL45DM_OVERRIDE_SHIFT 4
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_PLL_CTRL0_DIV_SEL_MASK 0x30000u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_PLL_CTRL0_DIV_SEL_SHIFT 16
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_PLL_CTRL0_DIV_SEL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_TRIM_PLL_CTRL0_DIV_SEL_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_TRIM_PLL_CTRL0_DIV_SEL_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_USB_REG_ENV_TAIL_ADJ_VD_MASK 0xC0000u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_USB_REG_ENV_TAIL_ADJ_VD_SHIFT 18
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_USB_REG_ENV_TAIL_ADJ_VD(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_TRIM_USB_REG_ENV_TAIL_ADJ_VD_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_TRIM_USB_REG_ENV_TAIL_ADJ_VD_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_D_CAL_MASK 0xF00000u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_D_CAL_SHIFT 20
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_D_CAL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_D_CAL_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_D_CAL_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DP_MASK 0xF000000u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DP_SHIFT 24
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DP(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DP_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DP_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DM_MASK 0xF0000000u
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DM_SHIFT 28
#define USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DM(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DM_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_TRIM_USBPHY_TX_CAL45DM_MASK)
/* TRIM_OVERRIDE_EN_SET Bit Fields */
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_DIV_SEL_OVERRIDE_MASK 0x1u
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_DIV_SEL_OVERRIDE_SHIFT 0
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_MASK 0x2u
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_SHIFT 1
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_TX_D_CAL_OVERRIDE_MASK 0x4u
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_TX_D_CAL_OVERRIDE_SHIFT 2
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_TX_CAL45DP_OVERRIDE_MASK 0x8u
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_TX_CAL45DP_OVERRIDE_SHIFT 3
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_TX_CAL45DM_OVERRIDE_MASK 0x10u
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_TX_CAL45DM_OVERRIDE_SHIFT 4
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_PLL_CTRL0_DIV_SEL_MASK 0x30000u
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_PLL_CTRL0_DIV_SEL_SHIFT 16
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_PLL_CTRL0_DIV_SEL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_PLL_CTRL0_DIV_SEL_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_PLL_CTRL0_DIV_SEL_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USB_REG_ENV_TAIL_ADJ_VD_MASK 0xC0000u
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USB_REG_ENV_TAIL_ADJ_VD_SHIFT 18
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USB_REG_ENV_TAIL_ADJ_VD(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USB_REG_ENV_TAIL_ADJ_VD_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USB_REG_ENV_TAIL_ADJ_VD_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_D_CAL_MASK 0xF00000u
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_D_CAL_SHIFT 20
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_D_CAL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_D_CAL_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_D_CAL_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_CAL45DP_MASK 0xF000000u
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_CAL45DP_SHIFT 24
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_CAL45DP(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_CAL45DP_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_CAL45DP_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_CAL45DM_MASK 0xF0000000u
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_CAL45DM_SHIFT 28
#define USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_CAL45DM(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_CAL45DM_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_SET_TRIM_USBPHY_TX_CAL45DM_MASK)
/* TRIM_OVERRIDE_EN_CLR Bit Fields */
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_DIV_SEL_OVERRIDE_MASK 0x1u
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_DIV_SEL_OVERRIDE_SHIFT 0
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_MASK 0x2u
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_SHIFT 1
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_TX_D_CAL_OVERRIDE_MASK 0x4u
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_TX_D_CAL_OVERRIDE_SHIFT 2
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_TX_CAL45DP_OVERRIDE_MASK 0x8u
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_TX_CAL45DP_OVERRIDE_SHIFT 3
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_TX_CAL45DM_OVERRIDE_MASK 0x10u
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_TX_CAL45DM_OVERRIDE_SHIFT 4
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_PLL_CTRL0_DIV_SEL_MASK 0x30000u
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_PLL_CTRL0_DIV_SEL_SHIFT 16
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_PLL_CTRL0_DIV_SEL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_PLL_CTRL0_DIV_SEL_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_PLL_CTRL0_DIV_SEL_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USB_REG_ENV_TAIL_ADJ_VD_MASK 0xC0000u
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USB_REG_ENV_TAIL_ADJ_VD_SHIFT 18
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USB_REG_ENV_TAIL_ADJ_VD(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USB_REG_ENV_TAIL_ADJ_VD_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USB_REG_ENV_TAIL_ADJ_VD_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_D_CAL_MASK 0xF00000u
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_D_CAL_SHIFT 20
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_D_CAL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_D_CAL_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_D_CAL_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_CAL45DP_MASK 0xF000000u
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_CAL45DP_SHIFT 24
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_CAL45DP(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_CAL45DP_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_CAL45DP_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_CAL45DM_MASK 0xF0000000u
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_CAL45DM_SHIFT 28
#define USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_CAL45DM(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_CAL45DM_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_CLR_TRIM_USBPHY_TX_CAL45DM_MASK)
/* TRIM_OVERRIDE_EN_TOG Bit Fields */
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_DIV_SEL_OVERRIDE_MASK 0x1u
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_DIV_SEL_OVERRIDE_SHIFT 0
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_MASK 0x2u
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_ENV_TAIL_ADJ_VD_OVERRIDE_SHIFT 1
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_TX_D_CAL_OVERRIDE_MASK 0x4u
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_TX_D_CAL_OVERRIDE_SHIFT 2
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_TX_CAL45DP_OVERRIDE_MASK 0x8u
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_TX_CAL45DP_OVERRIDE_SHIFT 3
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_TX_CAL45DM_OVERRIDE_MASK 0x10u
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_TX_CAL45DM_OVERRIDE_SHIFT 4
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_PLL_CTRL0_DIV_SEL_MASK 0x30000u
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_PLL_CTRL0_DIV_SEL_SHIFT 16
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_PLL_CTRL0_DIV_SEL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_PLL_CTRL0_DIV_SEL_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_PLL_CTRL0_DIV_SEL_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USB_REG_ENV_TAIL_ADJ_VD_MASK 0xC0000u
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USB_REG_ENV_TAIL_ADJ_VD_SHIFT 18
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USB_REG_ENV_TAIL_ADJ_VD(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USB_REG_ENV_TAIL_ADJ_VD_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USB_REG_ENV_TAIL_ADJ_VD_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_D_CAL_MASK 0xF00000u
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_D_CAL_SHIFT 20
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_D_CAL(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_D_CAL_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_D_CAL_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_CAL45DP_MASK 0xF000000u
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_CAL45DP_SHIFT 24
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_CAL45DP(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_CAL45DP_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_CAL45DP_MASK)
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_CAL45DM_MASK 0xF0000000u
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_CAL45DM_SHIFT 28
#define USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_CAL45DM(x) (((uint32_t)(((uint32_t)(x))<<USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_CAL45DM_SHIFT))&USBPHY_TRIM_OVERRIDE_EN_TOG_TRIM_USBPHY_TX_CAL45DM_MASK)

/*!
 * @}
 */ /* end of group USBPHY_Register_Masks */


/* USBPHY - Peripheral instance base addresses */
/** Peripheral USBPHY base pointer */
#define USBPHY_BASE_PTR                          ((USBPHY_MemMapPtr)0x400A2000u)
/** Array initializer of USBPHY peripheral base pointers */
#define USBPHY_BASE_PTRS                         { USBPHY_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- USBPHY - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBPHY_Register_Accessor_Macros USBPHY - Register accessor macros
 * @{
 */


/* USBPHY - Register instance definitions */
/* USBPHY */
#define USBPHY_PWD                               USBPHY_PWD_REG(USBPHY_BASE_PTR)
#define USBPHY_PWD_SET                           USBPHY_PWD_SET_REG(USBPHY_BASE_PTR)
#define USBPHY_PWD_CLR                           USBPHY_PWD_CLR_REG(USBPHY_BASE_PTR)
#define USBPHY_PWD_TOG                           USBPHY_PWD_TOG_REG(USBPHY_BASE_PTR)
#define USBPHY_TX                                USBPHY_TX_REG(USBPHY_BASE_PTR)
#define USBPHY_TX_SET                            USBPHY_TX_SET_REG(USBPHY_BASE_PTR)
#define USBPHY_TX_CLR                            USBPHY_TX_CLR_REG(USBPHY_BASE_PTR)
#define USBPHY_TX_TOG                            USBPHY_TX_TOG_REG(USBPHY_BASE_PTR)
#define USBPHY_RX                                USBPHY_RX_REG(USBPHY_BASE_PTR)
#define USBPHY_RX_SET                            USBPHY_RX_SET_REG(USBPHY_BASE_PTR)
#define USBPHY_RX_CLR                            USBPHY_RX_CLR_REG(USBPHY_BASE_PTR)
#define USBPHY_RX_TOG                            USBPHY_RX_TOG_REG(USBPHY_BASE_PTR)
#define USBPHY_CTRL                              USBPHY_CTRL_REG(USBPHY_BASE_PTR)
#define USBPHY_CTRL_SET                          USBPHY_CTRL_SET_REG(USBPHY_BASE_PTR)
#define USBPHY_CTRL_CLR                          USBPHY_CTRL_CLR_REG(USBPHY_BASE_PTR)
#define USBPHY_CTRL_TOG                          USBPHY_CTRL_TOG_REG(USBPHY_BASE_PTR)
#define USBPHY_STATUS                            USBPHY_STATUS_REG(USBPHY_BASE_PTR)
#define USBPHY_DEBUG                             USBPHY_DEBUG_REG(USBPHY_BASE_PTR)
#define USBPHY_DEBUG_SET                         USBPHY_DEBUG_SET_REG(USBPHY_BASE_PTR)
#define USBPHY_DEBUG_CLR                         USBPHY_DEBUG_CLR_REG(USBPHY_BASE_PTR)
#define USBPHY_DEBUG_TOG                         USBPHY_DEBUG_TOG_REG(USBPHY_BASE_PTR)
#define USBPHY_DEBUG0_STATUS                     USBPHY_DEBUG0_STATUS_REG(USBPHY_BASE_PTR)
#define USBPHY_DEBUG1                            USBPHY_DEBUG1_REG(USBPHY_BASE_PTR)
#define USBPHY_DEBUG1_SET                        USBPHY_DEBUG1_SET_REG(USBPHY_BASE_PTR)
#define USBPHY_DEBUG1_CLR                        USBPHY_DEBUG1_CLR_REG(USBPHY_BASE_PTR)
#define USBPHY_DEBUG1_TOG                        USBPHY_DEBUG1_TOG_REG(USBPHY_BASE_PTR)
#define USBPHY_VERSION                           USBPHY_VERSION_REG(USBPHY_BASE_PTR)
#define USBPHY_PLL_SIC                           USBPHY_PLL_SIC_REG(USBPHY_BASE_PTR)
#define USBPHY_PLL_SIC_SET                       USBPHY_PLL_SIC_SET_REG(USBPHY_BASE_PTR)
#define USBPHY_PLL_SIC_CLR                       USBPHY_PLL_SIC_CLR_REG(USBPHY_BASE_PTR)
#define USBPHY_PLL_SIC_TOG                       USBPHY_PLL_SIC_TOG_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_VBUS_DETECT                  USBPHY_USB1_VBUS_DETECT_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_VBUS_DETECT_SET              USBPHY_USB1_VBUS_DETECT_SET_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_VBUS_DETECT_CLR              USBPHY_USB1_VBUS_DETECT_CLR_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_VBUS_DETECT_TOG              USBPHY_USB1_VBUS_DETECT_TOG_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_VBUS_DET_STAT                USBPHY_USB1_VBUS_DET_STAT_REG(USBPHY_BASE_PTR)
#define USBPHY_ANACTRL                           USBPHY_ANACTRL_REG(USBPHY_BASE_PTR)
#define USBPHY_ANACTRL_SET                       USBPHY_ANACTRL_SET_REG(USBPHY_BASE_PTR)
#define USBPHY_ANACTRL_CLR                       USBPHY_ANACTRL_CLR_REG(USBPHY_BASE_PTR)
#define USBPHY_ANACTRL_TOG                       USBPHY_ANACTRL_TOG_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_LOOPBACK                     USBPHY_USB1_LOOPBACK_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_LOOPBACK_SET                 USBPHY_USB1_LOOPBACK_SET_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_LOOPBACK_CLR                 USBPHY_USB1_LOOPBACK_CLR_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_LOOPBACK_TOG                 USBPHY_USB1_LOOPBACK_TOG_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_LOOPBACK_HSFSCNT             USBPHY_USB1_LOOPBACK_HSFSCNT_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_SET         USBPHY_USB1_LOOPBACK_HSFSCNT_SET_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_CLR         USBPHY_USB1_LOOPBACK_HSFSCNT_CLR_REG(USBPHY_BASE_PTR)
#define USBPHY_USB1_LOOPBACK_HSFSCNT_TOG         USBPHY_USB1_LOOPBACK_HSFSCNT_TOG_REG(USBPHY_BASE_PTR)
#define USBPHY_TRIM_OVERRIDE_EN                  USBPHY_TRIM_OVERRIDE_EN_REG(USBPHY_BASE_PTR)
#define USBPHY_TRIM_OVERRIDE_EN_SET              USBPHY_TRIM_OVERRIDE_EN_SET_REG(USBPHY_BASE_PTR)
#define USBPHY_TRIM_OVERRIDE_EN_CLR              USBPHY_TRIM_OVERRIDE_EN_CLR_REG(USBPHY_BASE_PTR)
#define USBPHY_TRIM_OVERRIDE_EN_TOG              USBPHY_TRIM_OVERRIDE_EN_TOG_REG(USBPHY_BASE_PTR)

/*!
 * @}
 */ /* end of group USBPHY_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group USBPHY_Peripheral */


/* ----------------------------------------------------------------------------
   -- VREF
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VREF_Peripheral VREF
 * @{
 */

/** VREF - Peripheral register structure */
typedef struct VREF_MemMap {
  uint8_t TRM;                                     /**< VREF Trim Register, offset: 0x0 */
  uint8_t SC;                                      /**< VREF Status and Control Register, offset: 0x1 */
} volatile *VREF_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- VREF - Register accessor macros
   ---------------------------------------------------------------------------- */

